[
  {
    "Name": "Matt Quistorf - Professional Musician and Instructor",
    "Rating": 5,
    "Title": "Monster Grip is sure to help a player develop or maintain a lighter technique",
    "Date": "2014-01-01",
    "Review": "As an instructor I find it imperative that a student learns to keep a loose grip on the pick. The Monster Grips allow guitarists of all skill levels to focus on playing light and articulate without worrying about the pick flying out of their hands. With the advantage of being usable on any pick-type the Monster Grip is sure to help a player develop or maintain a lighter technique."
  },
  {
    "Name": "Zack - Guitarist for AFR",
    "Rating": 5,
    "Title": "I would recommend them to any guitar player",
    "Date": "2014-01-10",
    "Review": "Monster Grips provide exceptional grip and pick control even with moist hands. They have been very helpful to me in both live and rehearsal settings and I would recommend them to any guitar player who has trouble with pick control."
  },
  {
    "Name": "Guitar Noise",
    "Rating": 5,
    "Title": "That’s cool",
    "Date": "2014-01-12",
    "Review": "When I first saw Monster Grips I thought, that’s cool I drop regular Tortex style picks all the time and so have switched to Dunlop MaxGrips but they are nylon and not really my preferred pick material."
  },
  {
    "Name": "Found My Passion",
    "Rating": 5,
    "Title": "I’ve been really impressed with his product!",
    "Date": "2014-01-15",
    "Review": "I’ve been really impressed with his product! I definitely feel that my grip is much more sturdy when applying this small circular adhesive onto my guitar pick. <a href='http://www.foundmypassion.com/2014/01/review-of-monster-grips-silicon-grips.html' target='_blank'>Full Review</a>"
  },
  {
    "Name": "Picking Zone",
    "Rating": 5,
    "Title": "They really increase your grip dramatically",
    "Date": "2014-01-20",
    "Review": "The Monster Grips are such a great idea that you actually have to ask yourself why nobody had it before. Well, Andrew and his team had it, and they created a really cool product. The Monster Grip stickers work! They really increase your grip dramatically and feel good while playing."
  },
  {
    "Name": "Jesse Merkel - Instructor",
    "Rating": 5,
    "Title": "I’d have had a much easier time!",
    "Date": "2014-02-10",
    "Review": "I taught for nearly eight years. During that time, I had to teach hundreds of students how to hold a pick properly. If I had access to these grips back then, I’d have had a much easier time!"
  },
  {
    "Name": "JD",
    "Rating": 5,
    "Title": "Monster Grips helps to make the transition much easier",
    "Date": "2014-03-15",
    "Review": "I started out playing with my fingers, so switching to a pick was always difficult for me. Using Monster Grips helps to make the transition much easier when I need a harder or more percussive sound!"
  },
  {
    "Name": "Techie",
    "Rating": 5,
    "Title": "If you still drop your pick after using these, you probably ought to take up piano.  Just kidding!",
    "Date": "2017-01-10",
    "Review": "I'm an old geezer with arthritis, so holding a guitar pick can sometimes be an impossible challenge.  I've tried picks with holes in them, specially made acryllic or plastic ones, metal ones, etc.  I've even cut some out of old credit cards and made them bigger just to see if I could hold on to them.  Nope.  Then I tried some sticky gunk you put on your fingers... it DID hold the pick, but it also got that sticky crap all over my guitar strings and guitar body (and me!).  Lastly, I tried taping the pick to my fingers with cloth medical tape.  That actually worked pretty good, but getting the right angle on the tape is hard, and you have to make sure you're holding the pick at EXACTLY the right angle to play.  Whew!Enter MONSTER GRIPS.  They're a very thin silicone circle that has little bumps on it to hold on to YOU!  The littlie grips are self adhesive and stick very well to a clean pick.  I suppose they're meant to be just one per pick.  I put two each on 4 of my favorite pics.  I don't think I could drop them if I wanted to, but done this way they tend to gradually turn while I'm picking until the point of the pick is no longer hitting the strings.  I don't blame the product for this... I think it's because I used 2 grips on 1 pick.  I'll try just 1 on 1 again and see how that works.  I also think that, since I have trouble holding pressure on the pick, that a single grip placed against my index finger might work better than against my thumb.[LATER] Ok, the single grip on the side against my index finger seemed to do the trick!  I can move my thumb around, but lining up the pick with the strings is just a matter of moving my finger.  Who woulda thought that I would write so much about something so simple?Ok, I gave them 5 stars, and believe me, this product deserves it.  My only gripe is that the price for just 16 tiny (1/2\") circles of silicone is $10 on Amazon.  That's a lot of money for a relatively small product.  However, having said that, I've spent over $5 per PICK just to try to get something that would work this well.  You decide.  As for me, I'm gonna order another set of 16 very soon!"
  },
  {
    "Name": "R. Jackson",
    "Rating": 5,
    "Title": "Finally a pick-grip product that actually works.",
    "Date": "2015-08-19",
    "Review": "Over the years I’ve tried just about every pick grip product available. This includes all the gimmicky picks that were manufactured with some sort of no-slip mechanism built into them and never found one that worked. There was one add-on gripper that sort of worked but within a few minutes of playing it was rolling up under my thumb and the adhesive was sticking to my thumb, so I quit trying to find a decent product. Then I stumbled on something that caught my attention on Amazon: “Monster Grips”. I almost didn’t check it out but my curiosity got the better of me and I’m glad it did. I can’t say enough about these little gems. They actually perform as advertised, which is pretty refreshing in itself. For some reason I developed a really light grip and found myself dropping picks a lot. I tried to grip tighter but unless I concentrated on my grip I would revert back to a light grip and away goes my pick. That’s why I’ve tried so many products like this. These were priced cheap enough so i figured what the hell lets try em.  To sum up my opinion: they simply work. What else is there to know? They are so freakin’ thin you hardly even feel them, but they grip like nothing I’ve ever seen. They don’t roll up around the edges and there is no sticky residue at all. Amazing. I put them on both sides of the pick just to be safe but I ‘m not sure that’s necessary so I’m going to try one sided to see what happens. I also noticed they give me better control of the pick and I really like that too. And when you stop playing you can just slap the pick to your guitar so you don’t misplace it like I do on a daily basis.Somebody was thinkin’ when they came up with these little beauties!"
  },
  {
    "Name": "stacyb139",
    "Rating": 5,
    "Title": "Remarkable and Works Like a Charm!!",
    "Date": "2020-06-29",
    "Review": "I almost never write reviews, but in this case I feel like shouting from the rooftops!  I am a novice acoustic guitar player.  Up until I received these little plastic miracles, I could not keep hold of a guitar pick (plectrum).  I tried holding it straight, I tried holding it perpendicular, hard grip, loose grip, everything you can think of, but the pick would constantly move, dislodge, fall.  Very frustrating when one is a newbie trying to concentrate on chords.  So the next step was advice from much more advanced friends.  That led me to trying wedge-shaped picks, plastic picks, acrylic, bumpy, smooth, indented, all of the above.  No dice.  Then I came upon Monster Grips by sheer luck while looking at picks on Amazon.  The reviews are through the roof, but I thought, \"how can a piece of plastic be better than a 10 dollar bag of picks?\"  OH. MY. GOODNESS!!  This is it!  I bought a pack, put one on each side of the pick I was currently using, and BOOM!  Total grip!  As in the Nirvana of pick grippiness!  I cannot stress the relief I felt in my strumming hand the minute I had a stationary pick between my fingers.  It literally changed my playing instantly for the better.  No more buying and trying dozens of different types of picks.  All you need are Monster Grips.  For real, I just ordered my 4th pack!  My more advanced playing friends have \"borrowed\" so many of mine.  Highest praise for these little guys.  I'm so happy for the improvement in my playing."
  },
  {
    "Name": "R. Bailey",
    "Rating": 5,
    "Title": "Get a grip",
    "Date": "2024-07-06",
    "Review": "For all the years I've been playing guitar, I've always had one recurring problem: the pick slipping in my hand. I've tried everything and the pick would work its way loose. Then I found Monster Grips Guitar Pick Grips and they changed everything. My picks don't spin around between my fingers anymore when I play -- and that's all I ever wanted. Great product."
  },
  {
    "Name": "Mike Mack",
    "Rating": 5,
    "Title": "These are incredible!!",
    "Date": "2021-07-07",
    "Review": "I love these things.  I use them to make my standard guitar picks easier to grip.  But, I also use them to help hold my electric guitars in my lap.Even though I use a raised footrest under my right foot, my Fender Telecaster and Stratocaster can tend to ride up my leg toward my knee when I am playing while sitting down.  I tried a couple of non-slip solutions but was not happy with the results.  Then one day, I just stuck a few Monster Grips along the lower edge of my guitar and to my surprise, the slipping problem was solved!  I couldn't be happier.  My guitar stays exactly where it is supposed to be on my lap.  As an added bonus, Monster Grips, being transparent, are almost undetectable on my instruments.  They can be easily removed, if necessary, but have enough adhesion to stay stuck on my guitars."
  },
  {
    "Name": "RickR",
    "Rating": 5,
    "Title": "MONSTER GRIPS HAS A WINNER!",
    "Date": "2017-11-13",
    "Review": "I have dry skin and therefore tend to drop picks. I've used sticky goop, rosin, licking my fingers and cork to try and keep a pick in my fingers. I like the feel of these Monster Grips the best of all. I had a gig today and had prepared a pick with one of these. Once my body temp warmed it up I actually forgot it was there! The pick felt secure the entire gig, never slipped or shifted out of position. I'm sold. I'm ordering more of them.1-15-18I've been using the Monster Grips for a couple of months now and have added an extra on the opposite side of the picks I originally placed them on. As I stated originally my fingers are dry in this climate (Eastern WA) and the extra grip allows me to relax completely without worrying about pick movement or dropping them. I play Irish tunes on guitar and tenor banjo, and the right hand triplets require no hand tension, and now that I haven't got a death grip on my pick, the playing of triplets is much easier. Monster Grips are great.I’ve been buying your grips through Amazon for several years. Once I found your product there was no going back. I have dry skin and very little hand moisture, that together with living in Eastern Washington State where the humidity is very low, and I have a hard time keeping a pick in my fingers. I used to glue thin cork grips on my old picks which was OK but didn’t have the tactile sureness of yours.Thanks for contacting me after adding my name to your list. I was a bit freaked the I couldn’t get any more, the other types I’ve found aren’t even close to yours. The thin-ness combined with grip makes them the best on the market. If they lose a little tack a quick rinse with water and the tack is re-established, they also last. I’ve had some on my favorite picks for a couple of years.Rick"
  },
  {
    "Name": "mjpatey",
    "Rating": 5,
    "Title": "Little money, big improvement!",
    "Date": "2017-05-13",
    "Review": "I'm still a beginner player, just playing casually for my own enjoyment since last June. I tend to play (mostly strumming) with just my fingers, because with a pick I'm constantly losing it, or worrying about losing it. So I grip it really hard, and then it's really hard to control my playing; I feel like the proverbial bull in a china shop.So I got the package of Monster Grips. Forgetting what they looked like in the pics on Amazon, I was a little skeptical based on their unassuming appearance... I paid $10 for a little sheet of sticky tabs.Then I applied them to a pick and started playing. Instantly I realized I could handle and control the pick, with no worry of losing it. I could play loudly without using a death grip. I could actually play softly!Bottom line, I can control my playing better with these little guys. Because of my slippery, dry fingers (I'm getting older and losing moisture at an alarming rate), I normally can't seem to keep a pick from slipping out unless I hold onto it with a death grip. With these things, I sound like (and actually am) a more skilled and confident guitar player. They make the pick feel more like a natural extension of my fingers.Also must put in a good word for the people who make these... there was no tracking info, so I emailed the seller (who is the manufacturer). Got a personal email back from the owner himself, explaining the extra expense of tracking, and giving me a delivery estimate based on his experience. He nailed it. The free shipping took a few days from Rochester, NY to Maryland.Tl;dr: You want these!"
  },
  {
    "Name": "Lynn",
    "Rating": 5,
    "Title": "Where have these things been all my guitar-playing life?",
    "Date": "2020-12-18",
    "Review": "I don't typically drop picks, but I've always had trouble with them gradually slipping as I strum until I find myself flapping away holding onto a corner.  :-)These grips are made of grippy, but not too bulky, material. Look and feel good.My suggestion is to devote the first few to experiments. (They will peel off and re-stick a time or two, though they don't look as nice the second or third time.) Be a mad scientist. Try one on each side of the pick, just one on the thumb side, just one on the finger side, higher or lower on the pick. Cut them in half and experiment with the halves in various places. Form your own custom pick grip.Two halves in a strip right across the top on both sides works well for me. I can maintain thumb and finger contact with the pick itself, but I have a barrier to keep the pick from slipping out. But that's just me. My point is, experiment a little.Two \"complaints\":(1) In my opinion, there should be twice as many grips for the price.(2) That thing some people mention about how you can just slap your pick on the guitar with these and it sticks until you need it? Don't count on it. Maybe my hands are oily or something, but that works about one or two times for me after I put the grips on, but no more. Not a big deal, just saying.If you have trouble holding picks securely while you play, these are definitely worth a try."
  },
  {
    "Name": "flyerdog",
    "Rating": 5,
    "Title": "Yes!! yes indeed!",
    "Date": "2017-01-25",
    "Review": "these are awesome..just got them and have applied them with no problem on a Dunlop Tortex pick, which tend to be slick to begin with...and they hold like glue...I even had to remove one and re position it..and the adhesive held fast even after the reapplication.I discovered that for me the application of these would be a little un-orthodox. I apply them to both sides of a pick at the very top-center , away from the pointed end. What this does for me is lock my thumb and index finger in place somewhat passively. I have problems with the pick sliding up from my fingers and I typically choke down on the pick towards the pointed end.with the monster grips applied as I have, my thumb and index finger cannot slide up toward the top of the pick as there is now a physical barrier preventing that, and the rubber projections from the Monster Grip actually (almost) pushes my fingers back in place toward the tip of the pickAs a result I noticed that my picking hand has relaxed significantly, which = less fatigue, less locking up, more effortless picking..and more speed!!that alone makes these worth it for me..you can bet I am going to order MANY more of theseI also found another use for them...I applied some to my TV/Universal remote as 'feet'...and they keep the remote from sliding around and are unobstrusive..I often knock into my remotes and send them flying as I am a klutz sometimes...but these solved the problem!!"
  },
  {
    "Name": "DB",
    "Rating": 5,
    "Title": "GAME CHANGER!!!",
    "Date": "2018-02-07",
    "Review": "I'll put a longer, detailed review on here soon, but I got my first pack of these the other day and in just one little practice session I KNEW these were gonna help in so many different ways.  Not that I've ever held the pick too tightly (in fact, I generally use a pretty relaxed grip), but now that my thumb and finger are so much more relaxed, I can relax and let the pick angles and attacks flow SO much more easily.  Now that my grip is eased, I'm back to figuring out which of the many picks I generally like to use will benefit the most from adding the Monster Grips.  My Dunlop Jazz 3s, Primetones, my John Petrucci's, Ultex's, etc....or even my Gravity picks (which are great for grip if my fingertips are slightly sweaty, but they're not always sweaty) which now have a GREAT grip to them thanks to the Monster Grips.The oooooonly thing I would change (I think I'll email Monster Grips about it) is that I wish they had something like a standard pick-sized grip that you could apply on top of a pick and then just trim with a scissors.  That way the whole pick would have this great grip, no matter where my thumb and fingers grabbed it.Even if you're not sure if these may help you, they're $9.  Try a few, if they're not for you, share with a friend!"
  },
  {
    "Name": "William A Danford",
    "Rating": 5,
    "Title": "sticky and they hold",
    "Date": "2024-09-03",
    "Review": "I like these pick stickies...they are better than any other type I tried. I think this is the kind I like...in sheets of 16. How do I order more..?"
  },
  {
    "Name": "R. Houser",
    "Rating": 5,
    "Title": "Very good for mandolin players too.",
    "Date": "2015-08-06",
    "Review": "Just received these very thin peel-off monster grips for my mandolin picks. I have dry fingers and have tried all sorts of things to keep the pick from rotating in my fingers; sandpaper glued on, pieces of rubber mats, Handi-Tac, Sort-Quick on my fingers, you name it. All work to some degree, but these Monster Grips work better than anything I have tried. Dava picks have a built-in rubber grip surface that work well but the picks are thin and don't quite give the sound I like. I recommend cleaning the pick with alcohol before applying to get rid of oils.  I wish they were a little larger to cover more surface but you can always do like I did and use more of them on each pick. This is a nice solution to a frustrating problem.Update: i'm still using these because they work better than anything else I have tried. They lose their grip after a few uses because of finger oil, but they can be restored by washing with soap and water. I still would like to see a larger model so I wouldn't have to overlay the grips. They are just too small for my pick."
  },
  {
    "Name": "Susan Mocarski",
    "Rating": 5,
    "Title": "Solved My Stupid Arthritis-Can't-Hold-A-Pick-Anymore Problem!",
    "Date": "2022-03-23",
    "Review": "OMG - I'm so glad I found these! When I got them I thought, \"9.99 for THIS?\" but holy cow! YES! They are worth every penny! I've tried the picks with the zig-zaggy holes in them, picks with embedded texture, I've tried putting dried rubber cement on picks....  nothing works. The embedded texture grips are too far to the back of the pick. I hold a pick much closer to the point. With these, I put one on each side exactly where I want to hold the pick and it stays put and I can play through a whole song without it spinning around or flying out of my fingers. I just ordered another set because I don't want to every be without these!"
  },
  {
    "Name": "SkySteve",
    "Rating": 5,
    "Title": "What a Great Idea!",
    "Date": "2019-02-07",
    "Review": "Many of us have dropped guitar picks.  I've tried many types of picks, including the ones with groves, etc.  I've even made my own, adding holes with a leather hole punch and adding drops of super glue.  But the Monster Grip really works.  It is soft and a little spongy and really grips, both to the pick and to my thumb and finger.  My friend tried them and put two Monster Grips next to each other on both sides of a pick.  Another great idea.  Dropped picks are no longer a problem.  And they really do stick for a long long time to a pick, but are easy to get off, just by wetting them and pulling them off.  A great product for those of us with sweating fingers.  I can now grip the pick loosely to keep a nice feel of the guitar strings."
  },
  {
    "Name": "The Thinker",
    "Rating": 5,
    "Title": "Makes it easy to have a secure, stable connection with the pick",
    "Date": "2014-05-22",
    "Review": "I have only been using this product for a couple of weeks, but I am extremely pleased with it. I took an ordinary Fender pick and stuck one of these plastic pads on each side. The pads provide a high friction surface and a somewhat cushiony additional thickness to the pick that not only prevents the pick from slipping, to my joyful amazement, it provides a sense of integration of the pick with my thumb and finger. This integration immediately allowed me to pick significantly more accurately. Actually, the improvement in my picking accuracy is even more satisfying than the nonslip grip, which was the main reason I bought this product. Moreover, the secure connection with the pick requires only moderate finger pressure on the pick because the friction is so high. Initially, I was gripping the pick as tightly as I had done before. Now, however, lighter  finger pressure still provides a very secure connection with the pick. In summary, not only does this product easily keep the pick in place, it improved the accuracy of my picking. So far, I am thrilled with it. It will be interesting to see how it holds up over a period of several weeks."
  },
  {
    "Name": "Map",
    "Rating": 5,
    "Title": "Didn't know these existed!!!!",
    "Date": "2022-01-05",
    "Review": "As I was perusing Amazon the other day, I came across this accessory.  I like to use miniature picks so I thought, hey, what the heck, lets' try some.  Can't believe how many NON drops of the pick I don't make now.  When I take a pick that doesn't have this grip on it, it goes flying out my fingers!!  I am definitely spoiled now and I don't have to grip those picks so hard anymore and can concentrate on my fingering.  Would highly recommend these.  Downfall-- once a pick cracks/breaks, the grip doesn't peel off easily and won't really stick to another new pick so have to buy some more."
  },
  {
    "Name": "WVSharonanna",
    "Rating": 5,
    "Title": "I will buy more of these !",
    "Date": "2019-10-27",
    "Review": "I have only been using these for a week, but I really like them. They come in a pack of 16, so you can either use them for 8 picks, or 16, depending on your preference. I play with the  monster grip  only on one side, for my thumb. See the pros and cons list... there is only one con and it is minor ! Just separate your picks for easier retrieval.Pros-•Gives just right amount of grip, not thick and cumbersome• personalized placement- you put where you want & how many you want on each pick.• transparent surface- doesn’t interfere with the look of the picks• my picks do not spin any longerCons•  transparent-hard to find among regular picks when you store them in the same container."
  },
  {
    "Name": "Michael E Bromley",
    "Rating": 5,
    "Title": "BEST GUITAR PICK INNOVATION IN THE HISTORY OF GUITAR PICKS!!!!",
    "Date": "2015-01-14",
    "Review": "First review ever - these things impressed me so much I just had to say something. I can't say much about durability just yet but can say for sure that they will help anyone with dry fingers like me. I configured my picks with 4 total per pick - two across the top of each side. On Dunlop Ultex picks you have to really hug the edge for them to fit without an overlap. Once they were on - holy moly what a difference! I have struggled with pick slippage for over 20 years of playing, hobby, bar bands, recording etc. I was never able to squeeze any pick hard enough to really prevent slip without partially locking up my wrist... guitar players know what I'm talking about. These amazing little disks of silicon have changed me forever! I can now strum like a madman, loose and carefree without losing my pick during the mayhem! =)DO NOT HESITATE TO BUY THESE MIRACLE GRIPS! THEY ARE THE BEST THING EVER!!!!"
  },
  {
    "Name": "Dave",
    "Rating": 5,
    "Title": "This has become essential gear",
    "Date": "2022-03-15",
    "Review": "I play Metal, and as such I’m playing fast 90% of the time. My hands and fingers sweat while I’m playing, and I would constantly loose or have to reposition my pic while playing. I decided to try Monster Grips, after I got a suggestion for them on Amazon. I no longer have issues keeping hold of my pic. I just have one on each pic, I didn’t need one on both sides. Just that little extra grip that it adds is enough to keep the pic from moving at all. These have definitely become essential gear for me."
  },
  {
    "Name": "D",
    "Rating": 5,
    "Title": "Precisely what I needed",
    "Date": "2018-10-07",
    "Review": "Beginning to take rhythm guitar a more seriously, and I was having to get used to the pick rotating around and me eventually losing the grip... so I looked to Amazon for alternative solutions.I liked the style of pick I had gotten used to and didn't want to go down the road of trying new, bulkier, ones if I didn't have to.This was exactly what I needed.  It adds a thin, textured silicone dot to your pick that makes it pretty much slip-proof.  Turns out I only need one per pick (though I imagine 2 (1 per side) would provide an even better grip), so this package of 20 should last me quite some time.... but I fully expect to re-up with this same product again when the time comes."
  },
  {
    "Name": "Another Galoot",
    "Rating": 5,
    "Title": "Get a grip...a Monster Grip!",
    "Date": "2017-06-03",
    "Review": "I've always used Fender 351 medium picks. As I've aged the oils in my hands have subsided and holding a pick while playing was getting close to impossible. I tried the \"gooey\" products, tried drilling small holes into the pick, roughing the surface with sandpaper, tried bunches of other pick styles with patterns molded into them to provide a better grip. NONE were satisfactory! The Monster Grips work quite well for me. You may have to try them in several different positions to find the placement that works best for you. You may may also need to try just 1 Monster Grip dot or 2 to get the best grip and level of control of your pick. Whatever adjustments you have to make the Monster Grips just work extremely well. So well that I'm buying more and setting up a pack of spare picks."
  },
  {
    "Name": "Mark E. Rhodes",
    "Rating": 5,
    "Title": "Monster Grips, where have you been all my life???",
    "Date": "2015-12-27",
    "Review": "To be honest, I never had a problem dropping picks. My problem was that the pick would \"turn around\" in my hand. (I'd start out playing with the tip, look down later and see I was playing with the shoulder----or vive versa!) My biggest problem as my player for DECADES now has been inconsistency. I worked on picking exercises and on some days, I flew through them but maybe later that same day, I would sputter. Maddening! I sometimes thought of quitting. But I'm too stubborn to quit.Anyway, these grips keep the pick where I put it, which allows me to pick (or strum) with a consistency I never had before. They aren't sticky or tacky. You can put them wherever it suits you on any sort of pick you want to use. Why did no one think of this before? I feel like its a 'brand new day' for me as a player."
  },
  {
    "Name": "David Cain",
    "Rating": 5,
    "Title": "Almost perfect! replaced my cork picks.",
    "Date": "2018-02-04",
    "Review": "Just about perfect size and level of grip.I've got a permanent pick-thumb injury, and I've tried most everything, picks that hang on the ring finger, picks that wrap the thumb in fabric, all the picks with holes and rubber grippers and sleeves, finally settled down with cork rings for a good long time.But this is new for me. Smaller than most all the other grippers, and wow, what grip! Can apply to (I guess) any favored pick, doesn't add much thickness, so goes in my holder without trouble.If I have one complaint, it's that the grip is almost too good. You can't easily reposition the pick in your grip with a short spinning motion - it doesn't like to do that now. But that's a quibble. Was in love within 5 minutes."
  },
  {
    "Name": "j-penn",
    "Rating": 5,
    "Title": "Improve your picking in a day.....well maybe, but probably.",
    "Date": "2019-07-23",
    "Review": "What a cool invention, beats the round cork ones.  I never thought I had a problem holding on to my picks, apparently I did.  I pick quicker and more accurately with these things, I was holding on to my picks so tightly without thinking about it, my picking hand was probably had more muscle tension than I realized.  After trying these things I relaxed my grip and it noticeably improved my picking, and I thought I was pretty OK already, they may not be for everybody but I really do work for me.  I have been playing for 50 years it is nice to relax my right hand when playing and not worry about dropping my pick."
  },
  {
    "Name": "Kevin B. Phillips",
    "Rating": 5,
    "Title": "Love 'em",
    "Date": "2020-06-21",
    "Review": "I'm giving this product a 5 star. They are a little pricey for what they are, but hey, they do the job. I have been trying out picks for a while now. And I narrowed them down to Primetone and Tortex. I love the feel of Primetone with the grip they sell them with in my hand, bur prefer the sound of Tortex. I just wish Dunlop would make Tortex with a grip they sometimes feel slippery in my hand. Monster grip fixed that. They are easy to use and very comfortable in my hand as the grips feel gel like and they won't slip. At all. Very satisfied with the product."
  },
  {
    "Name": "M. Lawhorn",
    "Rating": 5,
    "Title": "Works for me!",
    "Date": "2019-07-09",
    "Review": "Wish I had been the one to come up with such a simple but effective product. I never learned to hold my pick \"properly\" and after 45 years it's a little late to reinvent the wheel. These little boogers really work well for me. They eliminated pick rotation when I play and after a short period of adjustment, I seldom if ever drop my pick any more. I only needed one per pick but evidently some players seem to find that two work better. If these things become soiled or lose their grip from finger oils just rinse and wipe them off . . . ready to go again and I always know which pick is mine!"
  },
  {
    "Name": "Indy Pov",
    "Rating": 5,
    "Title": "Dropsy Oppsy",
    "Date": "2020-02-15",
    "Review": "I use a heavy 1.9 mm pick and have regularly dropped during rehearsals - I bought the Monster Grips to help give some purchase and hopefully secure the hold on my pick.  I just received these but after installing on one side and a couple of hours of playing - no drops  So far So good  I will be in rehearsal Wednesday for 3 hours and that will be the acid test - if one side is good two may be betterI think these are over priced for what they are - however if they cure the dropsy they will be well worth the $$"
  },
  {
    "Name": "C",
    "Rating": 5,
    "Title": "GREAT PRODUCT & COSTOMER SERVICE",
    "Date": "2023-02-09",
    "Review": "Had a slight problem with shipping time but really don't believe it was manufactures fault. They completely took care of it & the Grips are the answer to hanging onto picks !!! Works & stays put. Thank for producing a product that solver the problem & excellent customer relationship,they took care of me. Thanks"
  },
  {
    "Name": "Scott A. Hardy",
    "Rating": 5,
    "Title": "Just the thing if you have dry old-man fingers like me",
    "Date": "2020-08-15",
    "Review": "The jell texture of these grips is just the thing!  Very positive grip if you have dry and slickish fingers like I do.  Just got them and haven't played with them long enough to review how well they will last or if they stay stuck, but my view after playing with them for a few days is they are the very biscuit!  I also tried some of the Mr. Power cork grips and they are good but too fat for me...Also the other grips for sale here on Amazon that are kind of like vinyl and those were totally useless."
  },
  {
    "Name": "guitarzan",
    "Rating": 5,
    "Title": "Monster Grips",
    "Date": "2023-02-14",
    "Review": "I have sweaty palm syndrome.  After a few minutes, my hands get so slippery I can’t hold on to my pick while playing my mandolin.  These Monster Grips keeps my pick from rotating.  My grandson called the stickum dots.  They get an A+ from me."
  },
  {
    "Name": "David Taylor",
    "Rating": 5,
    "Title": "Excellent pick grip!",
    "Date": "2023-03-31",
    "Review": "I love these grips! I found that they fit perfectly in the cavity of the picks I use by Jim Dunlop - https://www.amazon.com/Dunlop-475R3-0-Stubby-Purple-3-0mm/dp/B000EEJCDS/I think I have finally found the perfect pick solution for helping me grip my picks without dropping them or having them rotate while playing."
  },
  {
    "Name": "the king",
    "Rating": 5,
    "Title": "No more fishing picks out of the sound hole by shaking guitar upside down. \"Been there too Huh?",
    "Date": "2018-02-12",
    "Review": "These guys are a godsend for a pick dropper like me. I for years would have picks spin around my fingers or I would drop the pick while playing. Eventually, I quit using a pick on my acoustic guitar. Yep, 10 or so years ago I just learned to play without a pick. Best thing I ever did. A whole new world of style opened up to me. But last year I started to play electric. Now I need to use a pick again. Enter Monster Grips. I am able to get a good grip on my pick. I really like these guys. Put them on a few diffent picks of varying thicknesses and so far so good."
  },
  {
    "Name": "Amazon Customer",
    "Rating": 5,
    "Title": "Fixed problems I didn't know I had",
    "Date": "2023-01-18",
    "Review": "Been a guitar player for 44 years, and these things backed me up 10 years! I noticed I was losing some of my finer movements and hanging on to my pick. I put one of these on each side of my pick and wow, no more pick issues."
  },
  {
    "Name": "Rick",
    "Rating": 5,
    "Title": "Pricey, but I highly recommend.",
    "Date": "2019-02-21",
    "Review": "It hardly fails that my guitar pick gradually repositions slightly during a performance and I need to make a quick adjustment. I discovered this Monster Grips and decided to give them a try. Voila!! I’ve used other picks that provide the grip surface as part of the manufacturing, but usually can’t find any with the thickness I like. Also, I had an idea to place one on both sides of the pick for giggles-and-grins; that pick is going nowhere. I am a guitar teacher and my beginning students nearly always lose their position as they play, so I’ve put one on one of their picks which helped a lot."
  },
  {
    "Name": "USNA76",
    "Rating": 5,
    "Title": "The Best",
    "Date": "2022-11-19",
    "Review": "I've tried other brands of pick grips, and they're all too big and/or too fat. Monster Grips are just big enough to give you the grip you need, and small enough not to ruin the overall feel of the pick you're holding. Nice and thin, too. I highly recommend these. They set the standard."
  },
  {
    "Name": "Adam Shaw",
    "Rating": 5,
    "Title": "Works extremely well for me",
    "Date": "2016-07-15",
    "Review": "I am a newer player and have had a hard time keeping picks oriented correctly in my hand.  I switched to a 2mm stubby jazz pick which helps me out a lot, but I bought these at the same time to see how well they worked.  These things are awesome.  The adhesive works well and will stick to your pick for a long time - probably the life of the pick.  The material its self is a grippy kind of plastic gel.  My pick is now super secure in my fingers and I've noticed that my grip has actually relaxed a bit so my hand doesn't tire out from holding the pick.  If you have trouble holding your pick try these out. You will be happy with them!"
  },
  {
    "Name": "IF YA REALLY WANNA KNOW!",
    "Rating": 5,
    "Title": "Sticky Pick!.It Works!",
    "Date": "2016-12-29",
    "Review": "Brilliant!!,should've got more!,a pic?,well,I use V Picks,and as you know,keeping ONE plectrum around for \"ever\"?,yeah,so despite the many little boxes,key rings etc..ya lose em in no time!,but,they DO stick to your fingers and also I wish they made them SQUARE!,so you can know where the Tip is,(some picks are huge,so,which corner?,and are you hitting the flat part,so yeah,a teardrop shape?,but they work and that's that,and I probably will get em again,So 5 stars,and it shipped in no time,I've seen em,but grab a pack,it's really cool not to have to look or feel around if your holding you're pick right,in the heat of a gig or even at home recording,a slipping pick just as you hit you're groove is damn annoying!,anything that helps stop that is cool!"
  },
  {
    "Name": "Megaphone",
    "Rating": 5,
    "Title": "Using these with metal guitar picks",
    "Date": "2018-05-12",
    "Review": "I ordered these to alleviate some sweat problems I've been having with a Satriani chrome dome pick. Simply put, these grips totally fixed my problem. I'm using two grips on both sides of the pick and now it stays in the exact position that I hold it.So these grips are in fact not sticky in feel. It feels like silicone, but it's the inverted bumps that give it the grip. I can't really say much about it other than it does in fact work.As for all my other guitar picks, I've only applied one grip to the thumb side and this has worked just fine for me."
  },
  {
    "Name": "DGB12",
    "Rating": 5,
    "Title": "I can hold on to my picks!",
    "Date": "2020-12-19",
    "Review": "In this cold weather, being inside with gas heat makes it difficult to hold on to picks because of dry skin. These work fantastic! A great value! I tried that sticky stuff but it made more of a mess on things you did not want to get it on and did little to hang on to my picks. I also tried drilling holes in them and that helped some but not great.  These take care of that issue!"
  },
  {
    "Name": "Scott M.",
    "Rating": 5,
    "Title": "A Must Have For Me!",
    "Date": "2021-06-12",
    "Review": "I just received my 2nd pack of Monster Grips after using the 1st pack on my picks in the past.  They work perfectly for me and since I have a hard time holding picks tightly, these are a God send.  I don't lose grip at all with these and I hope that they never stop making them.  If they do, I'll have to buy the rest of their stock!  😁"
  },
  {
    "Name": "Amazon Customer",
    "Rating": 5,
    "Title": "No Slip MONSTER GRIP",
    "Date": "2023-03-25",
    "Review": "I have a difficult time holding picks because my fingers are very slick. I have tried picks with cork to no avail. These allow me to hold picks with no hint of slippage. Great product."
  },
  {
    "Name": "GKS",
    "Rating": 5,
    "Title": "Monster Grip.. a brilliant fix for your picks.",
    "Date": "2020-06-04",
    "Review": "Having to be isolated and mostly playing in the apartment nowadays I’ve adjusted my picking technique to help reduce volume.Unfortunately, this softer grip caused the pick to shift positions. Monster Grip fixed the problem permanently. I can now hold the pick in any position very lightly and it simply stays put. I don’t think my neighbors can hear me at all now! Just one under the thumb for me does the trick. The ultra thin design will also conform to the ones with a textured surface too."
  },
  {
    "Name": "nt",
    "Rating": 5,
    "Title": "Get a Grip on it !",
    "Date": "2022-08-20",
    "Review": "Excellent product and works very good. Easy to put on and they stay in place. They even adhere to textured picks. Not reuseable. I used regular alcohol to make sure surface was 100% clean. Please note, make sure exactly of the sticking location, it's a one shot deal!"
  },
  {
    "Name": "ngr",
    "Rating": 5,
    "Title": "These work great; make sure to use on the side of the pick touching your index finger",
    "Date": "2019-10-31",
    "Review": "These will definitely help prevent your picks from slipping while playing; just make sure that you have the grip on the side of the pick that touches your index finger (so the grip is between the pick and index finger) rather than on the other side (the side touching the thumb); otherwise, you won't really see any benefit.  These are very sturdy and can be moved from pick to pick several times and still stick to each pick extremely well (though they are a bit hard to remove once placed)."
  },
  {
    "Name": "Robert K.",
    "Rating": 5,
    "Title": "Great product but get an extra pack to experiment with.",
    "Date": "2022-12-07",
    "Review": "I use these on every one of my 4 pick types/sizes. If you haven't used stick-on grips before, get an additional pack to experiment with to get the right placement on the pick on front and back for best 'natural' grip."
  },
  {
    "Name": "Michael",
    "Rating": 5,
    "Title": "Pick grips",
    "Date": "2024-04-20",
    "Review": "Nice"
  },
  {
    "Name": "Garye",
    "Rating": 5,
    "Title": "These work! Wish they cost less.",
    "Date": "2018-05-24",
    "Review": "They are thin and light and not sticky [in a bad way]. I can now play with the picks I want to use that were way to slippery and out of control.I have restuck onto second pick and they are lasting great.I will be ordering more, but for now the two packs I bought should last for about 32-picks or more which could be 1/2 to 1 year if not longer. I will buy for friends to try too. Thanks to Monster Grips, I am now even faster and less fatigued which lets me relax more with less worries."
  },
  {
    "Name": "kindshuh",
    "Rating": 5,
    "Title": "NOW WE'RE TALKING.....",
    "Date": "2019-08-21",
    "Review": "This works!!!!! I've tried all, and while not perfect, that is short of suturing the pic to my finger pad, the pic stayed with me longer than any other product.  The indented pic sucked, gorilla giz worked but caked the strings with giz, cork is thermal sensitive as in cold room leads to contraction thus a slippery cork, hard pics/soft pics no difference.  But despite all my doubts the rubbery textured stick on (BOTH SIDES OF PICK) works for me.  Excellent low tech soln"
  },
  {
    "Name": "Amazon Customer",
    "Rating": 5,
    "Title": "They Work",
    "Date": "2019-12-28",
    "Review": "I have tried other grips with mixed success, so I strum with my fingers. Once I tried Monster Grips on a -88 Dunlop pick,  this is the answer for me.  I can now strum with a pick and not have it move all around and feel like i am about to drop it.  These are great.  I am mostly a fingerstyle and fingerpicking guitarist, but for some songs strumming is the way to go, and these monster grips really work for me."
  },
  {
    "Name": "Dan",
    "Rating": 5,
    "Title": "Very effective at stopping pick slippage",
    "Date": "2018-03-10",
    "Review": "I'm just a basement beginner but I found the Monster Grips to be very effective at preventing the pick from shifting or slipping from my fingers. One less thing to worry about allows me to concentrate on my bigger problems.  My one complaint is that they seem to lose some effectiveness after a month or two of regular playing. The instructions say that washing them with soapy water restores the tackiness, but that hasn't been my experience so far. Nevertheless, even if I have to replace them every month or two, a pack or two per year is still a worthwhile investment."
  },
  {
    "Name": "Dave C.",
    "Rating": 5,
    "Title": "Awesome Product!",
    "Date": "2022-09-15",
    "Review": "These grips work great! They are very thin but super grippy! They stopped the pick from turning while strumming, yet they don't feel bulky; they feel totally natural. Highly recommended! I ordered two more packs so I will always have some on hand."
  },
  {
    "Name": "J.D.  Conklin",
    "Rating": 5,
    "Title": "Not sticky residue,doesn't let your pick move, even with fairly light grip.",
    "Date": "2023-04-01",
    "Review": "Doesn't let your pick move, even with fairly light grip, . Haven't had them long enough to  judge the durability,, but so far I LOVE Monster Grips !!"
  },
  {
    "Name": "Jeff",
    "Rating": 5,
    "Title": "Seemed too expensive, but now I consider them a bargain",
    "Date": "2021-03-22",
    "Review": "These Monster Grips are great! I thought the price was ridiculously high before I purchased them, but I was rather desperate to find a solution to my guitar picks constantly slipping out of my grip. So I bought a pack, and I am very glad that I did. Playing my guitar is much more pleasant now that I can focus on the music without having to deal with a slipping pick."
  },
  {
    "Name": "JK",
    "Rating": 5,
    "Title": "Great Product",
    "Date": "2018-01-25",
    "Review": "It REALLY works.  I don't normally write reviews, but I had to comment that these grips really do work.  I've always had trouble with picks slipping & twisting in my fingers.  I've tried a bunch of supposedly grippy picks, but nothing really worked for me.  But these have made a huge difference in helping me hold the pick in the right position without slipping around while playing guitar.  These grips are very thin, so they don't change the feel in your fingers and are very comfortable.  A bit pricy, but well worth it IMHO."
  },
  {
    "Name": "jthomp830",
    "Rating": 5,
    "Title": "Perfect for more control",
    "Date": "2022-08-20",
    "Review": "I use thin Jim Dunlop celuloid picks. Because they are so thin and rather slick they can slip in my grip during hard, fast strumming. These grips are perfect for giving me a no-fail grip regardless of my playing style! I highly recommend!"
  },
  {
    "Name": "Rudy",
    "Rating": 5,
    "Title": "Great Solution",
    "Date": "2021-03-27",
    "Review": "I kept trying different picks in the hope that one with a textured surface would sound as good as my favorite one, but none did. Then I tried these. Problem solved! I stuck one on my favorite pick and was good to go. They are thin, inconspicuous and easy to apply. They stay put and make it easier to hold the pick without it slipping around. Well worth the price."
  },
  {
    "Name": "Amazon Customer",
    "Rating": 5,
    "Title": "Works great.",
    "Date": "2022-02-17",
    "Review": "Made the gripping area of the pick thicker, I did not like it. Lost some pick control.I moved them as  far back away from the tip as they would fit.... Now I love them. The grip is way back while my finger tips are still on the pick surface. Good grip. Accurate pick control."
  },
  {
    "Name": "Z",
    "Rating": 5,
    "Title": "Just What I NEEDED!!!",
    "Date": "2022-06-17",
    "Review": "Great product.  Prior I was dropping my pick or more often the pick was spinning - 90% degrees from where I want it.  No longer a problem.  Now my pick stays where I want it!!!  Very, very happy!!!"
  },
  {
    "Name": "ScottyG",
    "Rating": 5,
    "Title": "Yep, they work",
    "Date": "2023-05-10",
    "Review": "They do what they claim.  Makes it easier to hold onto your pick and with no sticky feel . Which is what I wanted"
  },
  {
    "Name": "Bruce",
    "Rating": 5,
    "Title": "Great item, works well, too expensive for what you get",
    "Date": "2022-07-16",
    "Review": "Item has great grip and durability.  Why too expensive for what you get.  They must have a 95% profit margin on this item.  That being said, they work and better than other items I have tried."
  },
  {
    "Name": "Kristen",
    "Rating": 5,
    "Title": "Best Product I've Found for This Purpose",
    "Date": "2021-11-09",
    "Review": "For years, I struggled with being able to grip a pick, and it was really frustrating. I did a lot of research because I knew there had to be something out there to help me. One day, I came across these, and they have exceeded my expectations! I've never searched for another product after finding these! They are well worth the money!!"
  },
  {
    "Name": "chris brown",
    "Rating": 5,
    "Title": "They work!",
    "Date": "2020-10-08",
    "Review": "These work way better than I expected, instead of trying to find a pick with extra grip because of dry hands from washing them all the time, I just tried these on my usual picks and they work! Seriously, thought it might be gimmicky, but I was super happy. A little pricey, but I'm not throwing out picks at shows"
  },
  {
    "Name": "Traveler",
    "Rating": 5,
    "Title": "Stick your Pick",
    "Date": "2022-11-21",
    "Review": "Just stick these guys on your favorite picks and you can forget about dropping your pick again. I apply one on each side and I'm good to go. So simple , yet so effective."
  },
  {
    "Name": "Mark",
    "Rating": 5,
    "Title": "These work!",
    "Date": "2020-12-23",
    "Review": "I was skeptical of how well theses would work, but they are just what I needed. I’ve tried many different picks that are supposed to be grippy, but still slipped through my fingers. The price seemed a bit much but I am very happy with them! I have dry skin, maybe those that say they didn’t work have slimy fingers, or they must be aliens from another planet."
  },
  {
    "Name": "Katy",
    "Rating": 5,
    "Title": "Yes.. they DO work!",
    "Date": "2021-02-03",
    "Review": "I am like several others here.. tried many many products.. one like sand paper stick ins sort of worked. But they would wear out .. come off etc.. These work ! And I have a much better feel because I am not gripping the death out of the pick to hold it.. this is what I will use from now on.."
  },
  {
    "Name": "Craig  M. Jamieson",
    "Rating": 5,
    "Title": "Amazing!!",
    "Date": "2018-02-18",
    "Review": "These things are pretty amazing! I have tried everything including buying picks with a hole in them, drilling multiple holes into picks that I have, and nothing has come even remotely close to these monster grips! As cautioned by other reviewers, if you have to reposition them, you have probably lost one (or two). I tried to do so on two picks. Oddly, the two on the one pick seems to have attached themselves well but, on the other pick, they did not. Two entirely different kinds of picks, mind you."
  },
  {
    "Name": "DNR",
    "Rating": 5,
    "Title": "Nice Product, Lots of Uses",
    "Date": "2019-02-26",
    "Review": "I purchased to try on guitar picks which are hard to hold on to sometimes. These little disks peal off of package and stick to the picks giving a sticky surface to hold to. They work and I plan to give them some time to prove themselves. So far so good. I can see other uses like cameras, cell phones, MP3 Players and even some small tools to stabilize in the hand. I would recommend giving them a try and see if they are for you."
  },
  {
    "Name": "John K.",
    "Rating": 5,
    "Title": "Always in Search...",
    "Date": "2021-05-22",
    "Review": "Over 50 years - ALWAYS IN SEARCH OF THE PERFECT PICK..............  Tried them ALL.These MONSTER GRIPS Are as AS CLOSE AS IT GETS.I must not be the only one - THEY ARE VERY DIFFICULT TO FIND!  When I Do See Them - I buy a BUNCH!"
  },
  {
    "Name": "Metal Mama",
    "Rating": 5,
    "Title": "The Bomb!",
    "Date": "2017-04-24",
    "Review": "Finally found a way to keep picks where they belong, in my hand.  Works well if you have dry skin.  For me it doesn't matter if it is on the thumb side or the finger side, the pick just stays put.  Less stress on my wrist when I don't have such a death grip on the pick, especially after an hour or two.I can still change my grip on the pick if I need to.  Works well with both Fender or Dunlop picks, thin or medium.  Awesome product, I will be re-ordering."
  },
  {
    "Name": "Joshua Y. Yuan",
    "Rating": 5,
    "Title": "pretty grippy, good for guitar picks",
    "Date": "2017-03-22",
    "Review": "i use these with v-picks screamers and for the first time in my life, my picks stop turning and moving in my sweaty hands. not that it makes me a significantly better player, i'm still terrible but at the very least i can't blame the position of my pick anymore, no more readjusting my pick once and awhile or dropping it.i have no tried it on other things. you get 16 little circles, and they're maybe slightly less than a centimeter in diameter but at least w.r.t a pick it's enough surface area to work."
  },
  {
    "Name": "Christian",
    "Rating": 5,
    "Title": "Very cool idea and they feel natural",
    "Date": "2019-03-06",
    "Review": "Wasn't sure what to expect on these but they are great! They are not in the way and feel natural. Thinner that I thought they'd be which is great. They amazingly grippy. Even you're not lighting picking, these make the pick easier to hold because you don't put as much effort into holding the pick.Suggestion: put one on and use it a while and you'll see there is an optimal position that is higher up on the pick that you might guess."
  },
  {
    "Name": "Cory Enderby",
    "Rating": 5,
    "Title": "So far so good",
    "Date": "2019-01-15",
    "Review": "So far these are working great. I will know more later on, but right now these are helpful.UPDATE:  Ok, I am not sure if I can properly play without these anymore... They are absolutely great.... I like the Fred Kelly picks with these... The only thing is is that I have to take my Dremel and grind down the nipples a little on the Fred Kelly pick in order for it to hold properly. But after I do that, they work awesome..."
  },
  {
    "Name": "Abigail B.",
    "Rating": 5,
    "Title": "These are great!",
    "Date": "2022-07-30",
    "Review": "These are very slim & really do the job on keeping pics from flying away or getting lost inside guitar. I've tried others but they were too thick. These are perfect for me."
  },
  {
    "Name": "A. Mullen",
    "Rating": 5,
    "Title": "Helps keep your picks from flying...",
    "Date": "2016-04-01",
    "Review": "I just started playing again after a five-year layoff and noticed that I was having a hard time keeping a grip on my pick, so I've been looking at different picks to see if I could find something easier to hang onto than my normal go-to Fender heavies.  I'm still with heavy 351s (Dunlop PrimeTones now), but one thing that I've added are these Monster Grips.  They make all picks easier to grip and less likely to slip out of my hand.  For what they do, they work well, although I do suspect they're a tad overpriced.  Still, recommended."
  },
  {
    "Name": "David L.",
    "Rating": 5,
    "Title": "Either way they work great but I am still experimenting to see what I ...",
    "Date": "2015-07-27",
    "Review": "I've been looking for a pick that would solve the slippage issued I have (very very dry hands).  This is the real deal.  First of all.. I have tried these with one on a pick and then two on a pick.  Either way they work great but I am still experimenting to see what I like best.....can't do that with a \"one size fits all\" pick.  2nd.....I don't have to go buying new picks in thin, thick and medium.  I can use the picks I already like.  Great idea....great product."
  },
  {
    "Name": "John Robertson",
    "Rating": 5,
    "Title": "These grips work with picks made of horn also.",
    "Date": "2019-02-07",
    "Review": "I have been using the grips for several months and they work very well. The adhesive doesn't move under the pad. They work with all styles of picks. I would recommend this product to stop pick rotation under the thumb and finger. I use grips on both sides of the pick. In addition if you have to play outside they work well in cooler weather. This is my third order and they are well worth it!"
  },
  {
    "Name": "Brother MOLOCH 969",
    "Rating": 5,
    "Title": "Impressive!",
    "Date": "2016-03-01",
    "Review": "I was skeptical at first but after ordering and trying them out, I have to say I'm sold. These work quite well and if you're one of those folks who are aging like yours truly where sometimes, for whatever reason, the smooth sided picks just slide out of your fingers, then this is for you. Worth every penny. I only use one sticky per pick which is enough and that's for my thumb side to grip. 16 to a pack so now I have enough to doll up enough smooth picks that I can buy some of the fancier picks to play around with."
  },
  {
    "Name": "Inform",
    "Rating": 5,
    "Title": "Get a Grip!",
    "Date": "2016-06-18",
    "Review": "These grip are fantastic, my pick tends to move while strumming hard,  and this has solved my problem.  Hopefully over time I will learn to regulate my pick grip a little better but for now this works wonders.Update: After using these pick grips for quite some time I have noticed that they get slippery from either the oils in you fingers or the grip itself is releasing some type of oil. You can restore the grip by cleaning it with rubbing alcohol but who wants to do that all the time. I have stopped using them at all."
  },
  {
    "Name": "Dan Dyson",
    "Rating": 5,
    "Title": "GETCHA PULLLL",
    "Date": "2017-08-30",
    "Review": "I don't usually leave reviews but this product was exactly what I was looking for and works just as advertised. I've been playing guitar 10+ years and have always struggled finding a pick with good grips that won't slip when the shredding gets heavy. Playing with the grips on will really help add stability and control to your picking. I've been spreading the word to all my guitar buddies and they love em as well. Hope to see some more nifty products in the near future from you guys. \\m/"
  },
  {
    "Name": "Booker",
    "Rating": 5,
    "Title": "Able to use for several purposes.",
    "Date": "2023-04-12",
    "Review": "Like the softness. After hand surgery couldn’t hold onto a guitar pick. Now I don’t have any problem."
  },
  {
    "Name": "Amazon Customer",
    "Rating": 5,
    "Title": "They Work!",
    "Date": "2021-07-23",
    "Review": "I’m an older beginner and couldn’t hold on to the pick.  With the pads, I’m able to hold the pick with a lighter grip that glides over the strings. I use them with a very thin .46 pick. So happy I decided to try them. My strumming improved overnight. Well worth it."
  },
  {
    "Name": "WW3",
    "Rating": 5,
    "Title": "A Winner!",
    "Date": "2020-09-08",
    "Review": "I have very dry skin so I found myself gripping the pick harder than necessary to keep it in place. I've tried various picks with surfaces that makes them less slippery but some picks that I like don't come with those options. These monster grips really make the pick easy to control."
  },
  {
    "Name": "Capital One Visa",
    "Rating": 5,
    "Title": "perfect size, perfect grip.",
    "Date": "2023-01-05",
    "Review": "the only criticism i would say is for the price, maybe should give us twice the grips."
  },
  {
    "Name": "Jack",
    "Rating": 5,
    "Title": "I loved them since I first used them and have gotten ...",
    "Date": "2016-07-09",
    "Review": "I have always had a problem with all types of guitar picks. These monster grips have solved this problem.  I loved them since I first used them and have gotten enough to last me a long time as well as share a few so others will know and appreciate them. If you haven't gotten any yet I highly suggest you buy some. Especially try these before buying yet another \"grippy\" type of pick. Over the years I've tried lots and lots of them but no more.  I'll be using monster grips from now on.Jack"
  },
  {
    "Name": "Gilbert",
    "Rating": 5,
    "Title": "These Pick Grips Really Work!",
    "Date": "2023-03-28",
    "Review": "I like that I don't drop picks anymore.  They're not really re-usable. That's why this is my second order."
  },
  {
    "Name": "RogerK",
    "Rating": 5,
    "Title": "These sticky grips are great",
    "Date": "2021-07-05",
    "Review": "I have low “stiction”; I seem to drop stuff a lot and these really help a lot.  I put one on a guitar pick and it helped immensely.  I’ll probably use them on other items.  Also, they’re very thin so you just get a better grip without the bulk."
  },
  {
    "Name": "Christopher S.",
    "Rating": 5,
    "Title": "Nice!",
    "Date": "2021-01-20",
    "Review": "This is exactly what I have been looking for. These little grippy things add a little bit of thickness to the pick but also some grip! But not too much grip, I can still easily re-position the pick in my fingers quickly but now it wont slip out of my fingers!...love it!!!"
  },
  {
    "Name": "Jerry G",
    "Rating": 5,
    "Title": "I stuck these on a few different picks and tried them out with great success. This is actually the second pack of ...",
    "Date": "2015-09-22",
    "Review": "When I originally saw these, I was a bit skeptical, but they were inexpensive, so...I thought, what the heck. I've been playing guitar for a long time, and I tend to have dry skin - leading to pick slip. I stuck these on a few different picks and tried them out with great success. This is actually the second pack of grips I've purchased. I don't think these babies are going to propel your talent into the level of rock stardom, but if pick slip or dropping your pick seems to be a pain the rump - give them a try. I like em!"
  },
  {
    "Name": "Tofurkey",
    "Rating": 5,
    "Title": "Amazing",
    "Date": "2021-01-03",
    "Review": "I was shocked to find how much these improved my grip, even on cellulose and the dunlop flex picks. These actually enabled me to use thicker picks than I was used to using since I wasn't gripping the pick so hard. I just got them today, so I haven't tried to reuse them yet."
  },
  {
    "Name": "Kirk Okonoski",
    "Rating": 5,
    "Title": "Works well",
    "Date": "2021-11-04",
    "Review": "I have weakness in my right hand after a neck injury and surgery and always had to look for specialty picks. These fit perfectly on my favorite picks and give me enough grip to play for long periods without slipping or twisting."
  },
  {
    "Name": "makyah theus",
    "Rating": 5,
    "Title": "Works like a charm",
    "Date": "2019-12-12",
    "Review": "My father is 6'3 and has very large hands and because he works with his hands they are also very dry. That being said it makes it very hard for him to keep hold of a pick. These have helped tremendously and they have stopped sliding from his hands all together. He says he'll use them for as long as he lives 👌"
  },
  {
    "Name": "Chiabatta",
    "Rating": 5,
    "Title": "The Best!",
    "Date": "2018-08-17",
    "Review": "These are the best thing out there for gripping your pick!  No icky residue to deal with and they last forever.  This is my 2nd purchase of these because I play multiple instruments and I use different types of picks depending on what sound I’m trying to get.  I highly recommend these.  The high cost might be the only con that comes to mind, but these will not wear out soon."
  },
  {
    "Name": "Ray Neill",
    "Rating": 5,
    "Title": "Love these",
    "Date": "2020-03-11",
    "Review": "These grips are great. I can’t live without them now that I’ve experienced playing with them. They work exactly as advertised. My only complaint (and it’s a small one) is that I think you should get more of them for the money. I put them on both sides of the pick and there’s only enough for 8 picks doing this...."
  },
  {
    "Name": "Steve",
    "Rating": 5,
    "Title": "These grips work",
    "Date": "2022-09-01",
    "Review": "I've tried many similar products, this is the only one that works for me.  I use very thick picks, .71 mm to 1.14 mm, and need a strong grip."
  },
  {
    "Name": "Old man",
    "Rating": 5,
    "Title": "Handy little things!",
    "Date": "2023-03-26",
    "Review": "Makes it easier to hang onto picks even if your hands are cold."
  },
  {
    "Name": "Anthony Puentes",
    "Rating": 5,
    "Title": "If you have sweaty clammy hands these grips will help significantly!",
    "Date": "2020-03-31",
    "Review": "Thought they were kind of pricy at first but after the first month of using them I’ve realized that the price is justified. Have more confidence/control when I have a grip on my pick. If you’re on the fence about purchasing this product I would absolutely encourage you to try them out. You will not be disappointed."
  },
  {
    "Name": "JJ Lee",
    "Rating": 5,
    "Title": "Great product for sweaty palms",
    "Date": "2022-07-26",
    "Review": "I've used this since 2015 it works great, and pick never slipped on me during gigs. Great product for people with sweaty palms, looking for solutions"
  },
  {
    "Name": "r",
    "Rating": 5,
    "Title": "Need to buy more",
    "Date": "2019-01-18",
    "Review": "I've never imagined a simple thing like this could make such a noticeable difference. I'm going to purchase more. My only criticism is that 10 dollars is too much for what they are. I guess idk the process of creating them, but i wouldn't bet it's too expensive. I think they should include more in the package. I enjoy these so much, i'm angry that i don't have more. There."
  },
  {
    "Name": "Jared G",
    "Rating": 5,
    "Title": "Work great on delrin and nylon.  Not repositionable.",
    "Date": "2014-12-07",
    "Review": "These things made my nylon and delrin picks finally sit still.  So far, a few weeks of 1hr/day play, and they are staying put.  Full marks.Two comments though.  First is that you can't reposition these.  Once they come off, they are done.  Plan carefully.  Secondly, grab the pick as you want to use it and find your ideal grip spots, which are not always at the center of the pick.  On one large pick, I used three, one each for my thumb and first two finger tips."
  },
  {
    "Name": "Fred Worth",
    "Rating": 5,
    "Title": "Very good product",
    "Date": "2015-08-20",
    "Review": "I am very impressed with this product.  I like to use the triangle, oversized picks for strumming and prior to getting this product at least once a jam session one would fly out of my grip and I would have to finish using my fingernails.  This sticks well on the pick (it will NOT accidently come off!) and doesn't feel \"icky\" like a piece of tape would.  It works better than punching a hole in the pick (looks better too!).  I have not tried moving it to another pick so I only use it on my non-breakable picks."
  },
  {
    "Name": "Kingston H.",
    "Rating": 4,
    "Title": "Best Grip Inhancement, I've tried.",
    "Date": "2019-11-08",
    "Review": "Product arrived late; USPS or vendor?.I am a cancer patient-  have lost the tactile sense in my fingers.Have experimented with any pick that says it \"grips\".  Best luckwas with Dunlop Prime Grip Delrin 500; but still had problemswith holding onto pick.  Then saw something called Pickers Grip -a \"creme\" you applied to your pick.  I put my pick in my mouth, a lot,so that didn't appeal to me.The Monster were an improvement.  Tried just one, on thumb side,but not quite there, added another on finger side.  It helped but no cigar.  Best combination so far."
  },
  {
    "Name": "Kindle Customer",
    "Rating": 4,
    "Title": "Work as advertised",
    "Date": "2019-11-14",
    "Review": "When strumming an acoustic guitar, I have always had the problem of the pick spinning in my fingers. Been playing for 45 years so you wouldn't think this is a big problem, right? Well, after all these years I finally tried to take care of the problem. AMAZING! If you position these little grips on the pick wherever you need them, they help way more than I could have imagined! Very happy with the product, but they are a tiny bit expensive, so 4 stars. They are thin enough that you can still slide the pick between strings if that's your method. Definitely recommend trying these."
  },
  {
    "Name": "Amazon Customer Bucolini",
    "Rating": 4,
    "Title": "Losses the grip after a while",
    "Date": "2015-10-15",
    "Review": "In my case it lost the initial grip and after, hmmmm, maybe 3 hours of playing time. Basically if I gave it enough time for my skin oils to seep into it. I read somewhere it can be cleaned but I was looking for set it and forget it solution, maintenance free. Otherwise I can still use a violin resin dust between my fingers which works great but like I mentioned I was looking for a maintenance free solution. To me it's more of a three star product but I appreciate the fact people are coming up with innovative products and making it here instead of outsourcing for a higher margin/profit. And I still like the pick better with than without the pad. I applied the pad on the thumb side only."
  },
  {
    "Name": "Andrew",
    "Rating": 4,
    "Title": "Works ok",
    "Date": "2023-05-26",
    "Review": "Constantly strugglibg to hold onto picks. Purchased this to help that. This works ok and helps a bit but still picks move around. Ok product"
  },
  {
    "Name": "rick",
    "Rating": 4,
    "Title": "We'll see.",
    "Date": "2022-01-24",
    "Review": "Seems like a quality product, but it took two stickers on one side to give me a more stable feel. Don't know how long they last or if they can be reused, but with only16 stickers to the pack, you could find yourself needing more sort of soon. If that turns out to be the case, $10 would be a lot to pay for them. We'll see."
  },
  {
    "Name": "KK",
    "Rating": 4,
    "Title": "Great pick grips",
    "Date": "2016-03-18",
    "Review": "As an older quitar player, picks tend to spin or slide out of my hands. These really help keep your favorite picks in place while playing. I found for me, that two pads on each side of the pick worked great for me.  (Side by side, they will not stick on top of each other).  Most people could get by with one pad per pick.  They stick great to the pick and I have not had one come off yet. I gave it 4 stars as I thought they were a little pricy but I have to admit, I will probably order another set in the near future.  If you have trouble holding picks, these just might be your answer."
  },
  {
    "Name": "Scott Cooksey",
    "Rating": 4,
    "Title": "Helps with picks slipping",
    "Date": "2023-04-01",
    "Review": "Greet addition to help keep picks in place while playing. Perfect size. They don’t get in the way."
  },
  {
    "Name": "Sensemaker",
    "Rating": 4,
    "Title": "Works great but could be better.",
    "Date": "2020-02-04",
    "Review": "I liked this product because it is the first grip for pick that actually work. However, they don’t last long and get slippery after a while.  If they only made it about 3/32” larger. This way it would cover a good portion Of the heart design type of picks.  That would definitely do it and I’d give 5 stars and my large fingers would be happy.  I would also be happy to for it at it’s current price..."
  },
  {
    "Name": "Wise Woman",
    "Rating": 4,
    "Title": "Serves its purpose",
    "Date": "2023-04-10",
    "Review": "Seller sent quickly...grips work close to as advertised...takes time to adjust to usage..."
  },
  {
    "Name": "tarboulton",
    "Rating": 4,
    "Title": "These grips seem to be working fine",
    "Date": "2022-02-28",
    "Review": "I have only had them for a few days so can not speak to the durability however they seem to be made of quality materials. They do make it more comfortable to hold my picks and I should be less inclined to drop them."
  },
  {
    "Name": "maulepilot",
    "Rating": 4,
    "Title": "... and the pick and keep it from moving as easily. They're easy to apply and seem pretty rugged ...",
    "Date": "2018-08-16",
    "Review": "These do improve the friction between your fingers and the pick and keep it from moving as easily. They're easy to apply and seem pretty rugged without being too large. These are round and not very large so you have to grip the pick in the right place for them to work. I think that a larger rectangular shape that you could trim with a razor knife around the pick's edge might be a bit easier to grip but it's not a show stopper."
  },
  {
    "Name": "Pneumaddict",
    "Rating": 4,
    "Title": "Improved grip,",
    "Date": "2020-09-27",
    "Review": "I'm extremely prone to dropping my pick while playing. Bought these trying to find a solution.While I did notice an improvement, I have to use 1 on each side of regular picks. Package has enough for 8 picks both sides I have to be careful not to lose them as these are not cheap.Using max-grip Jazz III's already, but these improved grip noticeabley."
  },
  {
    "Name": "Dennis A. Jankowski",
    "Rating": 4,
    "Title": "Work well, but a bit pricey",
    "Date": "2020-01-03",
    "Review": "The grips are great for holding onto the pick. Yet, they still allow enough flexibility for the user to do minor rotation of the pick while playing. It is great for the older player that may have lost much of the moisture in his or her fingers. However, the cost is on the high side considering the cost to produce is probably under a dollar."
  },
  {
    "Name": "Poolman Tom",
    "Rating": 4,
    "Title": "MonsterGrips work!",
    "Date": "2019-03-22",
    "Review": "MonsterGrips .... Stick on your pick, no more slip! Work just fine, seem like they'll last, and can be cleaned on the pick. Really helped me,  because my picks tend to slide around and turn between my 69 year old finger and thumb. A clean, economical method that works. I only reason I dropped a star because I'd like to have 'em in a bright color. 69 year old eyes, too."
  },
  {
    "Name": "Wayne L. Marshall",
    "Rating": 4,
    "Title": "Works great",
    "Date": "2022-12-08",
    "Review": "It takes a while to get used to but works well."
  },
  {
    "Name": "Syl Cat",
    "Rating": 4,
    "Title": "Pretty solid",
    "Date": "2019-10-27",
    "Review": "If your thrash and you need a reliable grip these do it.  I put one on each side of the pick because I'm a monster.  The only con is that I chew on picks and this really curbs that but that's more a me-issue. They could be less expensive for what you get but the quality of the product is good."
  },
  {
    "Name": "Ron Riddle",
    "Rating": 4,
    "Title": "Tiny but good.",
    "Date": "2019-12-05",
    "Review": "The grips feel great and work well, the only problem I have with them are that they are much smaller than a normal size pick. If they just came in a larger size they would be perfect. As they are, they still work well, you just have to make sure you center your finger and thumb exactly where you have placed the grips."
  },
  {
    "Name": "M. Marks",
    "Rating": 4,
    "Title": "Make a Difference for sure",
    "Date": "2020-07-11",
    "Review": "These make a difference for sure and are very comfortable. If they were a few dollars lower in price, they would totally earn 5 Stars. However, 4 Stars still makes a positive statement. Try them I think you’ll Like them!"
  },
  {
    "Name": "Sammy B",
    "Rating": 4,
    "Title": "I'm no pro, but I like them!",
    "Date": "2015-11-10",
    "Review": "My sweaty hands still can't keep a pick in hand, but they keep them longer thanks to these grips. I'm still learning to adjust myself to make the best sound, so I'm not sure if losing the pick is so much about how I hold the pick or the texture of it.Side note: I play guitar for Mass every Sunday and practice through the week. I have some experience, but I wouldn't trust myself to teach anyone."
  },
  {
    "Name": "Russell R. Herman",
    "Rating": 4,
    "Title": "has really aided my playing with arthritic hands.",
    "Date": "2017-04-17",
    "Review": "these have provided me a ton of extra grip on my older arthritic hands when strumming and playing praise & worship music for church.  tried several other types of grip picks and devices - this allows me to use my favorite picks - gives a slightly sticky and meaty texture to the picks - allowing me to have a much more secure grip when playing.  i place 1 grip on each side of the pick."
  },
  {
    "Name": "AbleMob",
    "Rating": 4,
    "Title": "Works well but a bit pricey",
    "Date": "2020-06-16",
    "Review": "They work great, but the pack of 20 works out to $.50 each which I think is a bit expensive for what they are. And I have to put one on each side of the pick, and you can imagine how quickly 10 picks go missing."
  },
  {
    "Name": "GRK",
    "Rating": 4,
    "Title": "Work well.",
    "Date": "2021-02-28",
    "Review": "Although these work and are good for the price. These little discs are very difficult to remove from the plastic sheet they are attached to."
  },
  {
    "Name": "Larry Scott",
    "Rating": 4,
    "Title": "Nice grips!",
    "Date": "2016-01-03",
    "Review": "I have very dry skin and these grips really help me hold onto the pick!'Gorrilla Snot' (sold by Amazon) gives me a little more 'grip' when playing spirited / fast guitar,but Gorrilla Snot also can be messy and gunk-up the strings.I will likely consume 16 Monster Grips in 4-8 weeks, thus Monster Grips is an expensive alternative to Gorilla Snot.I am glad I found Monster Grips, but the expense of Monster Grips will keep me using Gorrilla Snot."
  },
  {
    "Name": "Amazon Customer",
    "Rating": 4,
    "Title": "These work pretty good. I use large triangle picks so they ...",
    "Date": "2018-03-01",
    "Review": "These work pretty good.  I use large triangle picks so they could be a little larger for that type of pick.  Best to use on the non logo side of the pick against the tumb vs the index finger.  Can not store the pick in the strings on the fretboard since the grip will interfere with the grip."
  },
  {
    "Name": "Rick H. from WI - Amazon Customer",
    "Rating": 4,
    "Title": "These things are great. It really allows you to hold on to ...",
    "Date": "2016-09-14",
    "Review": "These things are great. It really allows you to hold on to the pick especially when strumming with emphasis. The only reason I didn't give them a 5-star rating is because you have to be really careful when you're putting them on. They don't lend themselves to being picked up and re-positioned. I don't know how you'd get around that, but it's something to be aware of. Take your time. Otherwise, it's a great product."
  },
  {
    "Name": "Sambonz",
    "Rating": 4,
    "Title": "Just OK",
    "Date": "2020-01-12",
    "Review": "These don’t work as well as I had hoped, but better than nothing. I ended up using my glue gun and putting some 100 grit sand paper on the upper half of my pick and that works great."
  },
  {
    "Name": "antonio",
    "Rating": 4,
    "Title": "Seems a bit overpriced to me.",
    "Date": "2015-03-04",
    "Review": "My hands are so sweaty they have made these useless. If you don't need a lot of grip these great but not if you're hands are really sweaty. In which case look at the Dunlop max grip jazz III. This is of course if you are planning to use them on picks because they are too small to be used with anything else; about the size of a dime."
  },
  {
    "Name": "wendy flores",
    "Rating": 4,
    "Title": "Great but not immortal",
    "Date": "2019-12-13",
    "Review": "These really make a difference in the accuracy of my playing and keep picks from getting sweaty & slippery.  Over time, though, the adhesive breaks down and they peel off so don't expect them to be indestructible."
  },
  {
    "Name": "Roy Samuelsen",
    "Rating": 4,
    "Title": "Does a good job",
    "Date": "2020-07-19",
    "Review": "Overall I liked them, but there are other pick grips that are better to hold on to the pick with, but they are thicker."
  },
  {
    "Name": "JR",
    "Rating": 4,
    "Title": "Just wasn't for me",
    "Date": "2017-01-29",
    "Review": "They do exactly what they say they do. These things add some extreme grip to your pick. The feel and the bulk it added to the pick just wasn't for me. I will not use them at all, but I still give them four stars because they do exactly what they claim. I have one extremely sticky pick... that I don't use."
  },
  {
    "Name": "Martin Richards",
    "Rating": 4,
    "Title": "Good idea",
    "Date": "2019-01-13",
    "Review": "These grips work great. They are very thin so they don't interfere or distract. Would have given 4 stars but the manufacturer was lazy in just giving us dots. a little more surface area, shaped to the pick would be a significant improvement."
  },
  {
    "Name": "Kindle Customer",
    "Rating": 4,
    "Title": "Makes a good pick better",
    "Date": "2020-12-16",
    "Review": "At times my dry fingers let the pick slip out of the prime playing position. These little rubbery stick-ons really help."
  },
  {
    "Name": "Billy",
    "Rating": 4,
    "Title": "THEY WORK",
    "Date": "2019-02-20",
    "Review": "finally something that works, the only possible issue is removing them from the plastic holder. they tend to dog ear and that portion has to be cut off with scissors. Other that that small dexterity issue, I LOVE THEM"
  },
  {
    "Name": "Virginia Mark",
    "Rating": 4,
    "Title": "Not too bad",
    "Date": "2020-04-27",
    "Review": "Not sure about these yet. It does add thickness to the pic which takes time to adjust. It does help with dropping pics."
  },
  {
    "Name": "Hairydad9",
    "Rating": 4,
    "Title": "Helps hold a guitar pick when strumming",
    "Date": "2019-03-21",
    "Review": "These work great! I'm having some trouble with my grip related to diabetic neuropathy and these allow me to hold a pick again while strumming. I would highly recommend these to any one having similar issues."
  },
  {
    "Name": "dayoldy",
    "Rating": 4,
    "Title": "Really nice; but room for improvment",
    "Date": "2019-12-30",
    "Review": "These are tantalisingly close to being perfect. I so-o-o wish that they were somewhat larger, and predominantly pick shaped - for even better grip and orientation by feel."
  },
  {
    "Name": "daisy",
    "Rating": 4,
    "Title": "Like the concept",
    "Date": "2019-01-05",
    "Review": "Like the concept and it appears to have a good grip. Adhered to my pick without issues; good seal/contact made. Took a long while to receive; huge down side. Overall, it does the job as stated"
  },
  {
    "Name": "Amazon Customer",
    "Rating": 4,
    "Title": "They work as advertised",
    "Date": "2019-11-15",
    "Review": "They work as advertised and give you more control of the pick.  But it doesn’t last forever.  Going to try a textured pick next."
  },
  {
    "Name": "Douglas Golden",
    "Rating": 4,
    "Title": "Gotta grip on it",
    "Date": "2017-03-19",
    "Review": "Applied to both sides of a relatively slippery guitar pick. Worked as advertised in that I could grip the pick much better and it didn't feel like it wanted to slip from my fingers. Time will tell on how long the grip will last but so far so good."
  },
  {
    "Name": "Brian Harrington",
    "Rating": 4,
    "Title": "No More Dropped Pics!",
    "Date": "2019-10-29",
    "Review": "I've always had a problem with losing control of or dropping pics.  These Monster Grips have made all the difference in the world."
  },
  {
    "Name": "Ralph C Trayler",
    "Rating": 4,
    "Title": "Great idea, need a little more size",
    "Date": "2020-03-04",
    "Review": "These work okay but could be a little bigger. I'd like to see their effectiveness with a slight increase in diameter"
  },
  {
    "Name": "Doogernorth",
    "Rating": 4,
    "Title": "Lets you use they picks you like and are used to but not have them slip ...",
    "Date": "2016-12-09",
    "Review": "Just started using them but they seem to be the ticket.  Key is where you put them on the pick relative to how you usually hold the pick.  Lets you use they picks you like and are used to but not have them slip around on you."
  },
  {
    "Name": "TheProf",
    "Rating": 4,
    "Title": "Helpful with slippage",
    "Date": "2019-05-11",
    "Review": "Helpful with slippage.  But I am still looking for the ideal thickness.  These are pretty thin, but have good grip."
  },
  {
    "Name": "DaleBryThatScienceGuy",
    "Rating": 4,
    "Title": "A bit on the thick side",
    "Date": "2021-05-24",
    "Review": "A bit too thick for my tastes."
  },
  {
    "Name": "wyldwulf",
    "Rating": 4,
    "Title": "I would like to see these in an obnoxious color option like ...",
    "Date": "2016-12-28",
    "Review": "Goot product. Stays put on most picks that don't have existing texture or raised print. I would like to see these in an obnoxious color option like bright monster green- to help locate black or clear picks that tend to fall and disappear."
  },
  {
    "Name": "Ed from No. Virginia",
    "Rating": 4,
    "Title": "Really helps you hang onto your pick!",
    "Date": "2019-05-05",
    "Review": "Had trouble with pick twisting as I strum - this solved the problem.  Great product - albeit a bit expensive."
  },
  {
    "Name": "david fawcett",
    "Rating": 4,
    "Title": "Awesome!!! I love theses things - keep your picks where they are meant to be - In your hands",
    "Date": "2018-02-15",
    "Review": "Work Great - my only wish is that they cam in larger packs at a discount and also larger grip sizes to take up more area on the pick"
  },
  {
    "Name": "Mary",
    "Rating": 4,
    "Title": "Excellent product",
    "Date": "2017-12-17",
    "Review": "Works very well. No more pick slipping. Takes a little to adjust my playing, being so used to my pick rotating. Wish i had gotten these years ago. Great product."
  },
  {
    "Name": "CurbsideLife",
    "Rating": 4,
    "Title": "Doesn't make my pic feel too thick.",
    "Date": "2016-05-27",
    "Review": "***UPDATE***( After 4 days it had lost its stickiness. So great out the gate but wears quickly. ) Doesn't make my pic feel too thick.  Pic no longer rotates in my fingers.  This product just plain and simply works."
  },
  {
    "Name": "Merlot C",
    "Rating": 4,
    "Title": "Been playing for decades before trying them but now wont ...",
    "Date": "2017-10-28",
    "Review": "Been playing for decades before trying them but now wont do without. Only reason I gave 4 stars instead of 5 is they are more expensive than Id expect."
  },
  {
    "Name": "steve lowry",
    "Rating": 4,
    "Title": "Great idea, haven't had the chance to thoroughly test ...",
    "Date": "2016-03-12",
    "Review": "Great idea, haven't had the chance to thoroughly test them yet but they look like they will solve the problem of slippery pick fingers.  They were priced well and delivered quickly."
  },
  {
    "Name": "RHSCO",
    "Rating": 4,
    "Title": "Could Be Thinner",
    "Date": "2020-07-29",
    "Review": "As I said....it could be thinner"
  },
  {
    "Name": "Adam Quinn",
    "Rating": 4,
    "Title": "Should cost $7.50",
    "Date": "2018-04-07",
    "Review": "They help keep pick from slipping but the price is a little much for what you get."
  },
  {
    "Name": "Dayne S.",
    "Rating": 4,
    "Title": "Easy to use",
    "Date": "2019-08-31",
    "Review": "Works well"
  },
  {
    "Name": "Nick",
    "Rating": 4,
    "Title": "Its ok",
    "Date": "2019-08-13",
    "Review": "Decent product"
  },
  {
    "Name": "ReRe",
    "Rating": 4,
    "Title": "Four Stars",
    "Date": "2016-12-10",
    "Review": "They did help him with his gripping issue.Just wished they were a little thicker."
  },
  {
    "Name": "soulman",
    "Rating": 4,
    "Title": "My basic impression is they do work as advertised but ...",
    "Date": "2017-01-17",
    "Review": "My basic impression is they do work as advertised but are a bit pricey which is my reasoning for a 4 star rating."
  },
  {
    "Name": "azbryanw",
    "Rating": 4,
    "Title": "Four Stars",
    "Date": "2016-09-17",
    "Review": "These work pretty well ....if your fingers get wet or sweaty they don't work as well."
  },
  {
    "Name": "Victor Cortes",
    "Rating": 4,
    "Title": "Works great",
    "Date": "2018-11-08",
    "Review": "They work great sticks right on pickd"
  },
  {
    "Name": "Lulu",
    "Rating": 4,
    "Title": "Keep your daughters away from musicians.",
    "Date": "2017-02-03",
    "Review": "Bought as a stocking stuffer for my daughter's boyfriend.  Then he broke up with her.  I hope they worked."
  },
  {
    "Name": "Amazon Customer",
    "Rating": 4,
    "Title": "Good, but could be larger.",
    "Date": "2017-07-23",
    "Review": "These work fine. Personally, I would like them better if the dot size were a little larger."
  },
  {
    "Name": "Thomas P. Panfile",
    "Rating": 4,
    "Title": "Fine but not the best",
    "Date": "2017-01-05",
    "Review": "They work fine but \"PickWorld MG3C-4T MojoGrip\" feel better to me."
  },
  {
    "Name": "Xopher Smith",
    "Rating": 4,
    "Title": "Four Stars",
    "Date": "2016-06-16",
    "Review": "This is a great product. I ding it one star because the price is Monster-sized."
  },
  {
    "Name": "mark osbon",
    "Rating": 4,
    "Title": "Careful where you put em they really stick good and work great",
    "Date": "2015-03-22",
    "Review": "I used them all and need more.Careful where you put em they really stick good and work great."
  },
  {
    "Name": "Sadc10",
    "Rating": 4,
    "Title": "Four Stars",
    "Date": "2018-01-25",
    "Review": "Love them, now I’ve stopped dropping my picks!"
  },
  {
    "Name": "Anthony R.",
    "Rating": 4,
    "Title": "Four Stars",
    "Date": "2017-06-22",
    "Review": "It would be 5 stars if they had a bit more tack."
  },
  {
    "Name": "Amazon Customer",
    "Rating": 4,
    "Title": "Four Stars",
    "Date": "2015-09-10",
    "Review": "It works well. I wouldn't call it a miracle solution but it definitely helps."
  },
  {
    "Name": "Amazon Customer",
    "Rating": 4,
    "Title": "Four Stars",
    "Date": "2016-08-03",
    "Review": "For me it did work well I liked it 😀😀😀"
  },
  {
    "Name": "Carroll",
    "Rating": 4,
    "Title": "Four Stars",
    "Date": "2017-01-18",
    "Review": "They're OK. One slipped off and it's gone forever. Dog might have found it."
  },
  {
    "Name": "joe b.",
    "Rating": 4,
    "Title": "Four Stars",
    "Date": "2017-04-19",
    "Review": "work well"
  },
  {
    "Name": "M. Robertson",
    "Rating": 4,
    "Title": "Four Stars",
    "Date": "2015-03-13",
    "Review": "Actually work pretty well but too expensive,"
  },
  {
    "Name": "Calculated Technology",
    "Rating": 4,
    "Title": "I like Monster Grips",
    "Date": "2016-12-11",
    "Review": "I like Monster Grips, and use them on most picks. They combine two benefits; the pick can be stuck on the face of your instrument, to be where you can grab it when needed, and of course it helps me hang on to the pick itself. A good deal all around!"
  },
  {
    "Name": "Sonic Ox",
    "Rating": 4,
    "Title": "Cool product but...",
    "Date": "2016-12-11",
    "Review": "I really like these grips but I use thin picks and the grips make them break more easily. Still a good trade off but the grips get expensive if you break picKS frequently.  I do still prefer them to stick um."
  },
  {
    "Name": "Harry",
    "Rating": 4,
    "Title": "Monster Grips rock!",
    "Date": "2016-12-12",
    "Review": "Great product.  Does exactly what it's advertised to do.  I don't use them on all my picks, but when I do need them, I know I can count on them."
  },
  {
    "Name": "Amazon Customer",
    "Rating": 4,
    "Title": "Effective Product",
    "Date": "2016-12-11",
    "Review": "Works pretty well! Fingers get kinda sweaty and slip off the grips after awhile but better than no grip at all!"
  },
  {
    "Name": "ChuckB",
    "Rating": 4,
    "Title": "These Monster Grips work ok.",
    "Date": "2021-11-20",
    "Review": "I tried the Monster Grips and they work ok.  For me however, I still need a bit more \"stickiness\" to keep my pick in check.  These will probable work well for most players."
  },
  {
    "Name": "Amazon Customer",
    "Rating": 4,
    "Title": "Thin enough so you can still control the pick.",
    "Date": "2021-08-25",
    "Review": "Liked the fact that I can grip all of my picks now and not still search for the \"perfect feeling\" pick."
  },
  {
    "Name": "Guy C.",
    "Rating": 5,
    "Title": "This product is just amazing.",
    "Date": "2014-12-29",
    "Review": "This product is just amazing.  No more flying picks :).  I have already recommended to my entourage and the response has been great.  Just a great idea at a great price, even in Canadian dollars.  And Customer service is no. 1 as well. Thanks."
  },
  {
    "Name": "James Franklin",
    "Rating": 5,
    "Title": "Love ‘em!",
    "Date": "2014-12-08",
    "Review": "Love 'em!  I have used this product for a year now, and now I RARELY drop a pick. This product certainly builds my confidence on stage. No more dropping a pick right in the middle of that killer bend or KILLER riff in the middle of the KILLER solo!  :)"
  },
  {
    "Name": "John Mason",
    "Rating": 5,
    "Title": "Monster Grips are the best invention since the wheel.",
    "Date": "2014-12-03",
    "Review": "Monster Grips are the best invention since the wheel. They do exactly as advertised. If you buy these you will \"never\" drop another pick while playing, either picking or strumming. One word describes them the best - AWESOME. Every guitar player should have them on their favourite picks."
  },
  {
    "Name": "Tattoo Matt",
    "Rating": 5,
    "Title": "I have always had issues holding into picks.",
    "Date": "2014-09-06",
    "Review": "I have always had issues holding into picks. I prefer smaller picks for their feel but it causes increasing problems with holding into them. Monster Grips provide a simple yet successful solution to help retain control. I have used products over the wars that leave fingers feeling tacky and just downright aren't worth the trouble. Monster Grips fills a gap in an industry and profession that has been needed and there is finally an answer to the problem of the \"soap bar\" pick."
  },
  {
    "Name": "Linda",
    "Rating": 5,
    "Title": "Highly recommend to any guitar player.",
    "Date": "2014-09-06",
    "Review": "Still a great product makes using those smooth unusable picks finally useful.  Plus great for ensuring my thumb stays in the correct location when practicing. I would highly recommend to any guitar player or musician who needs a better grip."
  },
  {
    "Name": "Andy",
    "Rating": 5,
    "Title": "Most wonderfully helpful thing I've bought in years.",
    "Date": "2014-09-06",
    "Review": "There are so many gimmicks, fads and essentially useless products in the music biz.  These are not.  Monsters are the smallest, cheapest, and most wonderfully helpful thing I've bought in years.  I also found there's no 'getting used to it' time.  Within seconds, they feel completely normal, and I now can't imagine using a pick which doesn't 'stick' to my fingers immediately.  The 16-pack is great too.  I cycle 4 picks, so with one monster each side, I still have half a pack left for the future.  5* Plus.  Great innovation guys."
  },
  {
    "Name": "aa.werner",
    "Rating": 5,
    "Title": "Great product with endless uses.",
    "Date": "2014-09-05",
    "Review": "These Monster Grips work great for holding on to my pick.  Not only that, but I use them on my Snark Tuner because the ones I bought were made of slippery plastic.  Now that I've put Monster Grips on them they stay in my hand fine instead of slipping out.  Great product with endless uses."
  },
  {
    "Name": "Colin Larson",
    "Rating": 5,
    "Title": "This product is simply AWESOME!!!",
    "Date": "2014-09-05",
    "Review": "I've been trying everything under the sun for years to help me get a better grip on picks (Glue Dots, Velcro Circles, Sandpaper, Rubber Washers, Rubber Bumber Pads, Skateboard Tape, Corkboard Circle Pads, Felt Circle Pads, Double Stick Tape, Putty, etc.) and none of these have been effective like Monster Grips. This product is simply AWESOME!!! The size, material and thickness is perfect and can be used on any kind of pick shape and material (tortex, celluloid, polycarbonate, delrin, ultex, etc.). For all you shredders out there like myself, I find I have better control now with Monster Grips than I did with all the other stuff I tried putting on my picks. One important key is that even though some of the other stuff I used in the past helped a bit with pick slippage, they felt uncomfortable. Monster Grips not only work the best, but they are comfortable and FEEL the best!!!!!"
  },
  {
    "Name": "Tim R.",
    "Rating": 5,
    "Title": "Highly recommended!",
    "Date": "2014-08-30",
    "Review": "Highly recommended! I like Dunlop Jazz III picks, which are easily grippable. So when I got custom (smooth) Jazz III-sized picks with my band's logo on them I found myself gripping the living hell out of them which caused my hand to ache. I had these picks that I paid a lot of money to have made but they were essentially unusable. So I bought Monster Grips and some of that tacky goo stuff. The tacky goo stuff is terrible. Sure you can grip your pick better but now your fingers are sticky (and it's a pain to wash off) AND your stick is picky. Or the other way around. Monster Grips were perfect. I put them slightly off-center on the non-logo side of my picks and play with my thumb on the Monster Grip. It made my unplayable picks usable again."
  },
  {
    "Name": "Brian",
    "Rating": 5,
    "Title": "Thanks for a great product",
    "Date": "2014-08-29",
    "Review": "So … Read the review in September 2014 issue of Guitar Player magazine … \"Hmm,\" thinks I, \"is this just another way for me to give away my hard-earned cash?\" Read it it a couple more times, watched the YouTube video, but still not convinced. Why? Last year I switched to using Dunlop \"Big Stubby\" 3mm picks, which have a pronounced textured dish on each side. \"Well, how's that going to stick?\" I wondered. And yet, and yet … Finally I emailed the good folks at Monster Grips to see what they suggested—\"Yeah, like I'm gonna hear back any time soon,\" I thought. Within two hours I heard back!! \"Yes, they do work, that's the pick I use myself,\" came the answer. I bought a set, which arrived in less than three days, and after getting used to them (one on each side), I've been recommending them to every guitar player I know. Thanks for a great product—now I have to live up to it!!"
  },
  {
    "Name": "Clark",
    "Rating": 5,
    "Title": "They really do work just as advertised.",
    "Date": "2014-08-29",
    "Review": "I've been playing the guitar since I was a teenager and I'm a senior adult now and I have NEVER found a pick I could hold on to until I found the Monster Grips.  They really do work just as advertised.  You can actually hold on to the pick.  I also like the way they play.......Great addition for guitar pickers....thanks"
  },
  {
    "Name": "John",
    "Rating": 5,
    "Title": "Great invention!",
    "Date": "2014-08-29",
    "Review": "You beautie!  They work perfectly at keeping my pick in place.  I suspect as I get older the sensitivity of my fingers is a little less and so I suffered from the pick moving position between my fingers all the time.  I even use them on picks which already have a textured surface, and the improvement is amazing. They are also great for increasing the thickness of the grip part of the pick, whilst keeping the flexibility of the pick itself so my tone sounds the same, but playability is very much improved. Great invention! Thanks a lot."
  },
  {
    "Name": "Ariel",
    "Rating": 5,
    "Title": "Strongly suggest to try this grip.",
    "Date": "2014-08-29",
    "Review": "Im 52 years old and a complete rookie, i found the right guitar for a beginner, but I could never feel comfortable with all the picks that I tried, thanks that I saw an advertising on Guitar Player Magazine and I tried them, if you are a newbie, I strongly suggest to try this grip, I put one on each side of the pick, and now I don't need to even look my hand, strongly recommended"
  },
  {
    "Name": "Lenny",
    "Rating": 5,
    "Title": "I'll be ordering more!",
    "Date": "2014-08-27",
    "Review": "It took me years to find the right pick for my playing style.  The Dunlop Ultrex .73 Sharp picks feel perfect to me, but come winter they are really hard to hold onto with the dry winter air and the dry skin that comes with it.   I have to switch to a 'grippier' pick during the winter, but it's just not the same.  Now with Monster Grips, I can use my favorite picks in any situation or season and not worry about dropping them.   Thanks for solving my problem, Monster Grips - I'll be ordering more!"
  },
  {
    "Name": "dan",
    "Rating": 5,
    "Title": "I really like this product.",
    "Date": "2014-08-27",
    "Review": "I really like this product. The thumb-facing side is grippy without being sticky. It is a pliable silcone-like plastic with bumps that nicely grab your finger. The pick-facing side has a clear adhesive that does not ooze or attract lint or dirt. The adhesive is pretty much permanent as I have not had any grips peel or slip off the pick. You can put Monster Grips on one side of the pick for a mild grip or put them on both side for a monster death grip."
  },
  {
    "Name": "HizLady",
    "Rating": 5,
    "Title": "The whole world just became available to me.",
    "Date": "2014-08-27",
    "Review": "Let Your Music Monster out of the Closet:  Stop Fighting Your Pick – Just Get A Grip! There are so many choices for picks – a variety of materials from celluloid and nylon to shell and exotic woods.  I love to experiment with different picks.  There is something amazing about walking along the beach and finding an oyster shell that the waves and wind carved into the perfect guitar pick and then to hear it played on stage creating musical euphoria for all who hear its song.  Yet… One thing stands in the way.  Shell and rosewood picks can be slippery and hard to hold. That perfect pick that sounds great, can only be brought to life as long as you can keep a hold of it!!!!  I have a large pick holder attached to my iPad (microphone) stand just for that reason.  I use to hold two of every style/type of pick so when one hits the ground, I can quickly grab another similar pick without changing the sound.   Life changed several months ago when this little kickstarter project developed a product that would let me hold any pick I want! Instead of having to buy a grip pick or one with sandpaper or a stupid little star hole – I can now easily, effectively, and without any damage to the material – grip my pick! A small textured adhesive patch can be placed in the exact ‘sweet spot’ of any pick, customized to my preferred grip.  The whole world just became available to me… no material is safe from being carved or repurposed to become a music making piece of art!  Best of all, the patch is removable and never leaves a residue or damages my highly prized exotic picks!  I design my picks with dual grips, thumb side a little higher – providing every pick the customization of being perfectly designed just for me!   When I’m done strumming and I want to finger pick for a verse, the grip can double as a static holder, keeping my pick secured to the front of my Martin guitar and ready for the chorus.  In an instant I can change from finger picking back to strumming with my pick without having to reach to the pick holder on my stand – instead just brushing my hand across the surface of my guitar… the static releases and the pick is effortlessly in my hand and I’m strumming again!  This adds a huge dimension to my music (and nothing left behind on my guitar!).   Remember my pick holder on my iPad stand? Well, it holds a variety of picks now.  No more duplicates!!!  Now I can have so many more options of materials and thus sounds, at my finger tips.  Creatively – an amazing adventure! Let your music monster out of the closet – stop fighting your pick – just get a grip, a monster grip!"
  },
  {
    "Name": "Arthur kerevan",
    "Rating": 5,
    "Title": "Would purchase again.",
    "Date": "2014-08-27",
    "Review": "Saw these in a mag.thought what an idea.but do they work.oh yes.makes plecs feel very secure and would purchase again.thanks."
  },
  {
    "Name": "Howard",
    "Rating": 5,
    "Title": "Thanks to Monster Grips",
    "Date": "2014-08-26",
    "Review": "Before Monster Grips, I could be counted on to drop at least two picks per set, causing humiliation and cacophonic musical train wrecks, and worst of all - driving all the girls away. But now, they chase me after every set, begging to know how I keep my picks from flying about like tiny missiles. Thanks to Monster Grips, my love life has never been better. I'm still a crappy guitar player though."
  },
  {
    "Name": "Denny",
    "Rating": 5,
    "Title": "THESE THINGS REALLY WORK!",
    "Date": "2014-08-26",
    "Review": "I am a creative guy.... I have melted, etched, punched holes, put adhesive backed sand paper onto my picks in the fervent hopes of keeping them from slipping from my fingers. My hands are VERY dry, limiting my gripping power on those slick little plastic devils. I have also bought picks with etched grips, dished out grips and various other built in grip improvements. ABJECT FAILURE ! UNTIL NOW !!!!! I admit, I was skeptical. Having made my own, ingenious (non) solutions, and bought many other \"improved\" models... REALLY, what could these people have done that was any better than what I had already tried ?????   I'm here to tell you, THESE THINGS REALLY WORK ! If, like me, you have slippery fingers  BUY MONSTER GRIPS  Such a small price for such a major improvement. Now, if I can only get my cheap brother to stop stealing my picks and buy his own MONSTER GRIPS."
  },
  {
    "Name": "Preppy",
    "Rating": 5,
    "Title": "I absolutely love these",
    "Date": "2014-08-26",
    "Review": "I realize I'm fairly new to guitar, but I absolutely love these. I got my guitar teacher on the bandwagon too!"
  },
  {
    "Name": "Reginald",
    "Rating": 5,
    "Title": "Thanks for the fine product!",
    "Date": "2014-08-26",
    "Review": "What a great idea.  I like the feel!  It allows for a secure grip without having to squeeze the bejesus out of my picks.  I like to use some different materials like horn or bone but sometimes they're too hard to hold on to.  If I'm worried about my grip, I find it hard to keep my wrist loose. your little dots of grippiness make it so much easier to hold the pick with less tension in my fingers and wrist.  Less afraid of pitching the pick across the room.  Thanks for the fine product! Reg"
  },
  {
    "Name": "Dean",
    "Rating": 5,
    "Title": "Really improved my playing.",
    "Date": "2014-07-03",
    "Review": "Great product!  As a beginning guitarist, these grips allow for a much looser grip on the pick which in turn helps when trying to mix up the speed of strumming - particularly when trying to execute a double strum within a normal 8th note strumming pattern.  Without the grips, the pick simply rotates too much during the strumming.  Really improved my playing."
  },
  {
    "Name": "Linda",
    "Rating": 5,
    "Title": "I would highly recommend these to anyone.",
    "Date": "2014-06-28",
    "Review": "i started learning guitar over a year ago and finding the correct pick has difficult, monster grips has meant any pick is now correct. I showed to my music tutor who said the saxophone players and also had uses for these as well as the fastest guitarists covering Spanish flamenco and quick paced material. I would highly recommend these to anyone. These have been a great purchase."
  },
  {
    "Name": "Santiago",
    "Rating": 5,
    "Title": "A great buy",
    "Date": "2014-06-21",
    "Review": "The \"real deal.\"  I've been playing for a long time and have always preferred small jazz picks.  Have jumped around from pick to pick and the problem of sweaty hands and slipping picks has plagued me for quite some time, especially during the jitters of playing live (yes, I get those too).  Ordered these bad boys to\"try\" them out.  Whoa!  All I can say is, they are the \"real deal.\"  No more slippage.  They allow the guitar pick stick to my picking fingers like none other pick has allowed me to do so before.  The very cool thing is being able to use them on any pick.  A great buy.  You'll be glad you did it, I sure am."
  },
  {
    "Name": "Rich",
    "Rating": 5,
    "Title": "This is a must-have item",
    "Date": "2014-06-05",
    "Review": "Bought a couple packs a few weeks ago, anticipating using more than 16.  Wrong, gonna need more than 32.  Renewed acquaintance with a bunch of picks of varying stiffness relegated to the bottom of guitar case.  I can now use the standard picks which were really slippery.  For me, need to use 1 grip per side, so they go fast.  Experimented using 3 on a pick, this works for us who hold the pick really loose and allows changing (sometimes deliberately) the position.  (Never said I am a consistent guitarist.)  Was using picks with some texture but was dropping those also...  This is a must-have item, one can't go wrong.  Wanted to provide a comment sooner after trying out different picks, but have been too busy practicing"
  },
  {
    "Name": "John Gazda",
    "Rating": 5,
    "Title": "Better than i had hoped for!",
    "Date": "2014-04-13",
    "Review": "Its about time! i have been a victim as well as a winner in the past buying different “stuff” for my guitars and amps! Hands down this is the best idea i have yet to experience in my years playing. No downside, in fact these little beauties work better than i had hoped for! Go figure, minimal investment, maximum functionality! You have a solid customer here! I never go on line and rave, but this time….. :) Kudos to a great idea, John Gazda"
  },
  {
    "Name": "Eric C",
    "Rating": 5,
    "Title": "I am very satisfied",
    "Date": "2014-04-03",
    "Review": "I am by no means an expert guitar player but I enjoy learning songs in my free time and I would occasionally have issues with dropping my pick. The great thing about Monster Grips is that you don't really notice them while you're playing. You'll be on your guitar for an hour only to realize \"wow, i never once came close to dropping my pick.\" It's at that moment that you realize what a great product this is. I am very satisfied and would recommend to any guitar player, regardless of experience."
  },
  {
    "Name": "Bill Cormier",
    "Rating": 5,
    "Title": "Very pleased.",
    "Date": "2014-04-01",
    "Review": "Absolutely great product!!  I've tried everything: drilled holes, double sided tape, etc... Nothing worked like these little discs do. Had a four hour rehearsal over the weekend and started with another \"bag\" product over my pick and dropped it twice. Took off the bag and had forgotten I had Monster Grips on the pick as well. No more  problems!!  Very pleased. Bill C"
  },
  {
    "Name": "Jon.horrocks",
    "Rating": 5,
    "Title": "Much better than gorilla snot and the like.",
    "Date": "2014-03-17",
    "Review": "Just received my pack of grips here in the UK. What can I say - awesome!!!  Easy to use and does exactly what it says on the tin. Grippy but not sticky. Much better than gorilla snot and the like. Will definitely be getting some more."
  },
  {
    "Name": "dennis",
    "Rating": 5,
    "Title": "Lovin' ,em!",
    "Date": "2014-03-14",
    "Review": "These little guys are great! I was worried they'd leave a film on my thumb, but not at all - lovin' ,em!"
  },
  {
    "Name": "Carl",
    "Rating": 5,
    "Title": "Love it.",
    "Date": "2014-03-14",
    "Review": "I have been using monster grips for about a week now and I have to say that I wish I invented these first! They are exactly what I have been looking for. I started by just adding it to one side of my pick but now I have it on both sides and it feels great. I also love the extra benefit of being able to stick my pick to the guitar when I'm done playing. It's not sticky at all yet it sticks to the guitar. How is that possible??? Love it."
  },
  {
    "Name": "Salvatore",
    "Rating": 5,
    "Title": "Worth it",
    "Date": "2014-03-14",
    "Review": "Works great! Very satisfied with the product, worth it for your favorite pick!"
  },
  {
    "Name": "Sid E",
    "Rating": 5,
    "Title": "I wish this product was around when I started playing.",
    "Date": "2014-03-14",
    "Review": "Have you ever seen a the guitarist at a rock concert smash his sweet guitar at the end of a set? It's because he dropped his pick. I absolutely love this product. When I play hard I used to drop my pick or have to readjust it in the middle of a song. No more. The other thing I love is that it can stick to my guitar. I like to pluck and use a pick in the same song, and now I don't have to hold it in my mouth and sing. I just stick it to the edge where I can easily grab it. I wish this product was around when I started playing."
  },
  {
    "Name": "Jon",
    "Rating": 4,
    "Title": "Excellent!",
    "Date": "2014-03-14",
    "Review": "Just received mine and they are exactly how I thought they would be. Excellent! Great grip and perfect for all occasions, especially those sweaty gigs where it ends up feeling hard to hold your pick. I would love for a whole SHEET of this product just so I could cut my own sizes, however, as I would want them to just be a bit bigger and my own custom shape for the way I hold my pick."
  },
  {
    "Name": "David Bakker",
    "Rating": 5,
    "Title": "No more slipping!",
    "Date": "2014-03-14",
    "Review": "Don't even have a guitar, still love these things. Small little ultra grippy stickers for use on my phone and camera. No more slipping!"
  },
  {
    "Name": "TDJMB",
    "Rating": 5,
    "Title": "They work great on V-Picks.",
    "Date": "2014-03-13",
    "Review": "The Monster Grips are just as advertised.  I have a twitch &amp; not too much grip strength in my picking hand - so they really help.  They work great on V-Picks.  I know V-Picks are known for already being \"grippy\" and the raised text on one side helps.  I put the Monster Grip on the other side and it really improved the grip and is not too thick.  They help on the black rubber triangular Herdim picks but, for those, I'd prefer a larger, triangular shape that would cover about half the pick &amp; could be trimmed to size.  Maybe this could be a new model?"
  },
  {
    "Name": "Aaron",
    "Rating": 5,
    "Title": "I would recommend this over any other alternative",
    "Date": "2014-03-11",
    "Review": "I am definitely happy! It is really as it is described.  It adheres to your pick on the backside, but the front grip surface is clean and dry and stays that way. I would recommend this over any other alternative as far as \"pick-additives\" go."
  },
  {
    "Name": "Josh",
    "Rating": 5,
    "Title": "I am a very satisfied customer.",
    "Date": "2014-03-08",
    "Review": "Hey, I just wanted to let you know that I received my Monster Grips yesterday. I have about four hours of use so far and I am a very satisfied customer. I wasn't sure how thick the pads would be, but they're very thin without sacrificing any grip at all! They're not sticky at all--just grippy in the perfect way. They're very comfortable, light, and perform exactly as I hoped they would. Congratulations on a great product!"
  }
]